[
  {
    "id": 1,
    "category": "Adventure",
    "image": "assets/images/adventure.jpeg",
    "stories": [
      {
        "id": 1,
        "title": "Mahalo King Cod Filet",
        "story": "<article><p>A slate-grey sky hung heavy over the President James K. Polk Memorial rest area on Interstate 64 in southern Indiana. At the fueling station, eighteen wheelers lined up under bright green lights for diesel and windshield wiper fluid from an army of apathetic attendants. A mother carrying a styrofoam coffee cup emerged from the Kwik Mart, pulling the collar of her neon pink and light purple ski jacket tight around her neck with her free hand and hurrying her two children across the broad expanse of cracked tarmac. A grove of oak trees, damp brown and bare of leaves for months now, peaked above the domed roof of the food court. At the far end of the parking lot, a mountain of exhaust-stained snow towered precariously over a red and yellow dumpster belonging to Solid Waste Disposition Incorporated, Akron, OH. A cacophony of colors and commotion.</p><p>Frank eased his Kia into a parking spot and surveyed the scene. He was not like the rest of them, hustling to-and-fro on their way to somewhere else, to grandma’s house for Christmas, perhaps, or home after a work trip in Louisville or Wheeling or Pittsburgh. No. For Frank J. Marone, the President James K. Polk Memorial rest area was the destination.</p><p><br></p><p>In front of him, a fifty-foot steel pole held aloft the black and red cowboy hat signage of the Arby’s Corporation, the curved lines of the double-peaked crown and round brim glowed a warm red against the cold of the December day.</p><p><br></p><p>He picked up his phone, smiled, stuck his thumb up, and snapped a selfie. Below the image, he typed, “It’s been twelve years since I started this journey. At last, I come face to face with my white whale (or is it a cod?).” He sent it off to his forty-eight thousand-plus followers and then scrolled through his timeline. Back to the beginning, to 2009, the Roy Rogers outside of Toms River that still served the Cordon Bleu Gold, discontinued nationally in 2005. That one had been pretty easy. Just a quick jaunt down the Garden State Parkway. There and back in a short afternoon. Number nine on the list: the McSalmon Fritters, which he'd found at a barely functioning McDonalds outside of Homer, Alaska. That one had required more doing, an online fundraiser and a series of puddle jumpers.</p><p><br></p><p>It had started as a lark, the quest for obscure and discontinued fast food items. Something to do. To pass the time. Shits and giggles. After he'd crossed number five or six off the list of twenty-five sandwiches and tenders and salad shakers, though, the quest had taken over his life, become his identity.</p><p><br></p><p>Frank set the phone back down on the passenger seat and watched it buzz and ding with congratulatory missives. In front of the Arby’s, a man shuffled back and forth and spoke to himself angrily, a burned-to-the-filter cigarette hanging from the corner of his mouth.</p><p><br></p><p>Frank was there to meet a man about a sandwich. Gordon Warmbacher, franchisee of sixteen Arby’s restaurants across the upper Midwest and Great Plains, about the legendary Mahalo King Cod Filet, to be precise. The Mahalo King was the last on his list that included the KFC Turkey Tender, the Burger King Ostrich Deluxe, and Taco Bell’s Cool Ranch Gator Taco, served exclusively in Louisiana and the Florida Panhandle. He had dedicated the last twelve years of his life to tracking these items down and reviewing them for his ever-increasing number of social media fans and fast food aficionados.</p><p><br></p><p>Of all the items on the list, the Mahalo King Cod Filet had proven to be the most elusive. Introduced by the Arby’s Corporation at select stores in 2006, sales had badly underperformed expectations. Reviews were initially poor. People had mocked the incongruity of a New England fish served Hawaiian style. The pineapple slices that sat atop the deep-fried filet smothered in traditional Hawaiian huli-huli sauce would, if left for even a few minutes, soak through the sesame seed bun, leaving it soggy and difficult to pick up. Sales of the sandwich were discontinued after only four months, but it had become something of a cult favorite, with a small but devoted fan club dedicated to getting it back on the menu.</p><p><br></p><p>There had been tips. Whispers and rumors of rogue Arby's restaurants still serving the sandwich. Frank had followed one dead end lead after another for nearly a year and a half and had been on the brink of giving up when he received a cryptic Direct Message from Gordon. It could be arranged, Gordon said, but Frank would need to be discreet. Details needed to be omitted, a certain degree of anonymity required. Gordon had a lot on the line.&nbsp;</p><p><br></p><p>Frank opened his car door and walked briskly toward the Arby’s entrance and past the man with the cigarette, who cursed at Frank under his breath. He entered and looked around. It was mid-afternoon, the quiet time between the lunch and dinner rushes. Brown and tan anti-slip tiling covered the floor in front of a recently-modernized counter manned by three maroon-shirted and bored looking employees. A middle-aged man in thick-rimmed glasses and a mustache waved to him from one of the booths lining the far wall. Gordon stood and extended his hand toward Frank as Frank approached. He smiled broadly. Gordon squeezed Frank's hand firmly and shook once, up and down. The two men slid across the brown vinyl seating across the table from one another.&nbsp;</p><p><br></p><p>“It’s a real pleasure to meet you,” Gordon said once they had settled in. “I’m a fan of your work. Been reading your blog since… Oh let’s see. Well, at least a couple of years now.” His accent was upper midwestern. Wisconsin. Or Minnesota, perhaps.</p><p><br></p><p>“That’s very kind of you to say.”</p><p><br></p><p>Gordon had a fair complexion with pink cheeks. His skin was pockmarked, probably from teenage acne. Despite it, he was handsome. His greying hair was well cut and the tailoring of his linen jacket appeared bespoke. He looked more suited to someplace with tablecloths and waiters with extensive knowledge about wines and cheeses. Frank, in his wrinkled tee shirt and unwashed jeans, felt suddenly underdressed.</p><p><br></p><p>“I’ve got my staff working up our order now. Two Mahalo Cod Filet sandwiches, side of waffle fries. What sort of pop do you like to drink?”</p><p><br></p><p>“Sprite will be fine. Thank you.”</p><p><br></p><p>“Of course. I don’t even know why I asked. I should have known.”</p><p><br></p><p>“I know you said you would treat me, but really, you don’t need to do that.”</p><p><br></p><p>“Please. Don’t mention it. It’s my pleasure.” He called across the mostly empty restaurant. “Two large Sprites, no ice in mine.” One of the women behind the counter nodded.</p><p><br></p><p>Gordon turned back to Frank. A silence fell over the booth. After a moment, Frank spoke.</p><p><br></p><p>“How do you keep making it? The Mahalo King. It’s been, what, more than a decade since it was discontinued?” A statement in the form of a question, his voice rising slightly on the last syllable of the final word.</p><p><br></p><p>Gordon smiled mischievously. “Amazing, isn’t it. Seems like it was only yesterday. I was just starting out with my first Arby’s back then. Up in Toledo. That was a big year for me. I hate to toot my own horn, but I've come a long way since then.\"</p><p><br></p><p>The woman from behind the counter approached tentatively, put the Sprites on the table, and handed each of them a straw. Gordon stabbed the straw through the perforation on the plastic lid, took a long sip, and then cleared his throat.</p><p><br></p><p>“When they announced that they were going to stop putting it on the menu, I bought up as much of the huli-huli sauce as I could. I made calls as far as Texas and California. Got the stuff FedExed to me overnight shipping. Nobody understood why I wanted this stuff. The Mahalo King never sold very well, as I'm sure you know. They were happy for me to take the stuff off their hands.\" He chuckled. \"I’ve still got a few thousand servings left in my warehouse over in Sioux City. The rest I just sort of pull together on my own. The cod and pineapples. Those I get from the grocery store like anyone else would. Of course, the ingredients aren’t exactly the same as they would be if they came through the normal distribution channels, but I think we've done an admirable job recreating it.”</p><p><br></p><p>Gordon took another sip of Sprite before continuing.</p><p><br></p><p>“What can I say? I just love this sandwich. I couldn’t let it go. Of course, corporate doesn’t approve of me serving it.” He lowered his voice to a whisper. “Which is why I have to be so secretive. It’s a violation of policy. They could take away my franchise license if they find out I’m still serving it off menu.” Gordon winked theatrically.</p><p><br></p><p>Frank nodded. “I appreciate that. And don’t worry. I’m being very careful not to give away any specifics.”</p><p><br></p><p>Gordon looked around the restaurant. He took his glasses off, fogged them with his breath, pulled a cloth from his pants pockets, wiped the lenses clean. “Ah, here they come now.”</p><p><br></p><p>A different server, a young man in an Arby’s baseball cap walked toward them carrying a brown plastic tray. He lowered it onto the table and then turned and walked briskly away.</p><p><br></p><p>“Voila,” Gordon said with a flourish of his hand. “I give you the Mahalo King.” He picked up the cardboard basket that contained the sandwich and placed it in front of Frank. “There’s some extra huli-huli. I can’t get enough of the stuff.” He put two little clear plastic containers next to the sandwich. The liquid was thin and jet black.</p><p><br></p><p>Frank observed the sandwich. The bun was already soggy from the pineapple slices. The critics had been right about that, he noted. He took out his phone again. Gordon smiled and then leaned his body away from the frame. “There she blows,” Frank typed out, invoking Melville once again. He pressed send and put the phone on the table face down. It immediately started to rattle and shimmy toward the edge. Frank took a deep breath and closed his eyes.</p><p><br></p><p>“This is a big moment for you,” Gordon said solemnly.</p><p><br></p><p>“Twelve years. Twenty-three thousand miles. Fifty thousand followers,\" Frank recounted. \"Can I ask you, something?\"</p><p><br></p><p>\"Shoot.\"</p><p><br></p><p>\"If you were reading my feed and you knew that I was looking for this sandwich, why didn't you call me sooner?\"</p><p><br></p><p>Gordon smiled. He tore off a bit of waffle fry and put it in his mouth, chewing deliberately. \"Well, I supposed I could have done that, but it would have been a little too easy. Don't you think? I didn't want to deprive you of the journey.\"</p><p><br></p><p>Frank opened his eyes and turned his head toward the window. It was starting to snow.</p><p><br></p><p>“Have you thought about what you’re going to do next?\" Gordon asked. \"Now that you've reached the end of your list, I mean.\"</p><p><br></p><p>Frank watched the lights of traffic slide past on the interstate beyond the parked cars and the fifty-foot glowing sign and the fueling station and the tower of dirty snow and the bare oak trees. He thought about the drive home, his one-bedroom apartment with its few pieces of prefabricated Swedish plywood furniture, his job managing logistics for an office supply outlet. He thought about Gordon building his empire of Arby's. Finally, Frank turned back to the man sitting across from him. “I don’t know yet. I guess I’ll need to figure that out.”</p><p><br></p><p>Gordon sighed and smiled understandingly. “You’ll have time for that later, I suppose. What's important is that we've got these Mahalo Kings.\" Gordon picked up his sandwich and held it aloft triumphantly, urging Frank to do the same. \"For now, let's just savor the moment.\"</p></article>"
      },
      {
        "id": 2,
        "title": "Unpaving Paradise",
        "story": "<article>\n    <p>Imagine how hard it is to break up asphalt with a pickaxe. Now imagine it's not even a very good pickaxe. And you've been doing it for days. The sun, hotter now, makes the sweat bead on your face, itchy like a bug landing on you. Sometimes enough water escapes your pores to form a little stream that carves a path down the black dust on your face. And it tortures you that your body is letting such a precious resource just drip onto the ground. Unretrievable.</p>\n    <p>This has been my existence for almost a full moon. Me, my pickaxe, and the pavement. My hands have carved grooves into the handle as the handle has chiseled callouses onto my hands. I worry my arms won't know how to do anything else by the time I get to stop. Will they remember how to hug? How to hold?</p>\n    <p>I don't want to tell you how much more asphalt there is to go.</p>\n    <p>Sometimes, I get to use a shovel to heave the crumbles of concrete into the circulating wheelbarrow. It comes past my plot every hour or so. They say a change is as good as a break. I would like to state for the record that it depends on the degree of change.</p>\n    <p>&nbsp;</p>\n    <p>They didn't have a plan for removing the concrete jungle, the people who poured it out and put it up. It always grew bigger, never smaller. Engineers only thought about how to lay it down, not about who was going to have to pick it back up. That’s my job now. To rip it up to reveal the earth underneath, all pale and wrinkly like skin under a cast that has been on too long. And if they had thought about it, they would never have imagined doing it with a pickaxe.</p>\n    <p>&nbsp;</p>\n    <p>They didn't have a plan for any of it. If they had, I wouldn't be here.</p>\n    <p>&nbsp;</p>\n    <p>I can stop at any time. This isn't a prison sentence. It's more like penance. No, that’s not quite right because it’s not my sin I am trying to atone for. More like a damage deposit for my existence. For everything that I will take, I must first give something.</p>\n    <p>&nbsp;</p>\n    <p>I see my fellow pilgrims scattered across the hot mirage of black flatness, multicolored spray-painted lines designating each person’s plot. Some have left their posts and are sitting in the shade of the trees by the roadside or have gone into the Mall to lie down on their mats. But I turn back to my pickaxe. It helps to imagine the sweat on my back as if it was cool grass or the wet wall of a dark cave.</p>\n    <p>&nbsp;</p>\n    <p>I don’t join them. I don’t rest. I'm on a time limit. It’s hard to know when my time will be up, when the biological clock that is on the Mainland will run out.</p>\n    <p>&nbsp;</p>\n    <p>&nbsp;</p>\n    <p>Now I’m working by the full moon and there are no clouds. Enough light to work in the blessedly cool darkness. I have to take advantage of these nights so I haven’t slept in two days.</p>\n    <p>&nbsp;</p>\n    <p>Every time I put down my pickaxe, I feel the fear. The fear that I won’t finish in time. That I’ll be so close but that it will be too late. I imagine being able to see the finish line and then getting word that it’s too late. And that the finish line has moved or disappeared. And if I’d only kept going and not took that break, if I’d swung a little harder, shoveled a little faster, I would have made it. And our lives could have begun.</p>\n    <p>&nbsp;</p>\n    <p>So, I pick up the pickaxe. Lift it and let it fall. I have to sleep soon.</p>\n    <p>&nbsp;</p>\n    <p>My plot is bigger than most since I’m unpaving for two. “This is how it starts,\" my wife told me when I volunteered to unpave for both of us. “This is how patriarchy restarts. I can do it with you. Women can -”</p>\n    <p>&nbsp;</p>\n    <p>I put my hand on her arm. “Plenty of women unpave. You know this isn’t about that.”</p>\n    <p>&nbsp;</p>\n    <p>“It is always about that.”</p>\n    <p>&nbsp;</p>\n    <p>“It’s not worth it. If something were to happen… It’s not worth it.”</p>\n    <p>&nbsp;</p>\n    <p>“I know...”</p>\n    <p>&nbsp;</p>\n    <p>We had made it to the Coast a few days before. Between bike repairs, scavenging for food, and avoiding bike gangs as often as wild animals, it had taken us longer than we thought. We set out from the Prairies as soon as we estimated there wouldn’t be any threat of snow in the passes. It was not an inevitability that we would make it. I imagine the people in the Before and how certain they could be that they would make it to their destination. They probably didn’t even think about it. We were constantly reminded by the shapes of bicycle skeletons, abandoned by the roadside. God only knows where the skeletons of the riders are now.</p>\n    <p>&nbsp;</p>\n    <p>But it had been more certain that we would die if we spent another frigid winter on the Prairies. It was clear when we got there that we weren’t the only ones to risk a dangerous journey with the hope of ending up somewhere better. People had been waiting so long to cross, a small village had erected itself in the ferry terminal.</p>\n    <p>&nbsp;</p>\n    <p>By the time it was our turn, my wife had already told me the news. She would try to keep it secret for as long as possible but we decided I would have to cross alone.&nbsp;</p>\n    <p>&nbsp;</p>\n    <p>And so now I am here and she is there, with a sea between us until I finish.</p>\n    <p>&nbsp;</p>\n    <p>&nbsp;</p>\n    <p>I shovel chunks of the scar I have unstuck from the Earth into the wheelbarrow. The young girl who is pushing the cart today smiles at me and says, “The Earth thanks you,” as she moves away. She must be new. It’s what people say to each other here in the Parking Lot. It’s supposed to be encouraging, to remind us that this is a great service. But it just sounds like words to me now.</p>\n    <p>&nbsp;</p>\n    <p>You don’t realize how much concrete there is until you need to grow your own food. When there aren’t any cars to park on it, the black flatness looks so impotent.</p>\n    <p>&nbsp;</p>\n    <p>The monks who run this Parking Lot and Mall, which is now their church and where the pilgrims sleep, sometimes walk the plots to preach to us.</p>\n    <p>&nbsp;</p>\n    <p>“As we break open the asphalt and renew the crust of the Earth, so too shall we renew ourselves and be found worthy.”</p>\n    <p>&nbsp;</p>\n    <p>They’re keeping the useful pavement of course. The roads and the bike paths. More practical minds will only let their unpaving crusade go so far.</p>\n    <p>&nbsp;</p>\n    <p>“Like weeds through the cracks of asphalt we will persevere and you will be born again into this new world, this Paradise.”</p>\n    <p>&nbsp;</p>\n    <p>They often remind us about the Paradise. This Island where people don’t go hungry. The Island where the homes can heat themselves. The Island where no one fights over the scraps of the Before. The Island where there is enough. And we, the lucky ones, will be able to be part of it. We will be given a bicycle and a home and a plot of arable land. And safety.</p>\n    <p>&nbsp;</p>\n    <p>We just need to break up some concrete first. It’s only fair.</p>\n    <p>&nbsp;</p>\n    <p>&nbsp;</p>\n    <p>I’ve had a setback. I woke up inside the Mall, my head splitting. Apparently, I collapsed from dehydration. The monks say they will only let me work for so many hours a day now. They don’t want a death on their conscience.</p>\n    <p>&nbsp;</p>\n    <p>They won’t let us out of the Lot so I am stuck pacing the perimeter. I don’t know what to do with all the extra time. It’s time I don’t want to be spending. I can’t afford it.</p>\n    <p>&nbsp;</p>\n    <p>I ask newcomers if there is any news from the Mainland. My wife said she would try to send letters with pilgrims who cross. There is never any news. I hope she’s still alive.</p>\n    <p>&nbsp;</p>\n    <p>I am close now. The resting may have actually done me good and I am making progress. I plead with the monks to let me work more of the day. I contemplate sneaking out at night but can’t risk censure. I can’t be sent back when I’m this close to finishing my plot. I can taste more than just the dust of the asphalt now. I can taste the Paradise, it’s so close to being ours. I can taste my wife. I fantasize about her lips and her skin and her belly, almost not seeing the black pavement I’m ripping up, just feeling my arms lift and lower as my eyes see only her face. Up and down, up and down, up and down. Day after, day after, day after -</p>\n    <p>&nbsp;</p>\n    <p>“Hey, woah there, stop for a minute. STOP!”</p>\n    <p>&nbsp;</p>\n    <p>I realize there is a monk standing beside my plot.</p>\n    <p>&nbsp;</p>\n    <p>“You have a wife on the Mainland, right?”</p>\n    <p>&nbsp;</p>\n    <p>I blink stupidly at her, trying to clear the sweat and my wife from my eyes. Finally, I nod.</p>\n    <p>&nbsp;</p>\n    <p>“She’s had a baby.” The monk says flatly. It is not a congratulation.</p>\n    <p>&nbsp;</p>\n    <p>My pickaxe falls as my knees crunch into the pavement. I wasn’t fast enough. I didn’t make it.</p>\n    <p>&nbsp;</p>\n    <p>“Is she alright?” I search her eyes.</p>\n    <p>&nbsp;</p>\n    <p>“She’s still alive and the baby is too.”</p>\n    <p>&nbsp;</p>\n    <p>She looks at the small square of unbroken asphalt that is all that is left of my plot. She takes a can of spray paint out of her pocket and shakes it.</p>\n    <p>&nbsp;</p>\n    <p>“Babies are expensive for the Earth, you know.”</p>\n    <p>&nbsp;</p>\n    <p>I watch as she draws a new line around me.&nbsp;It is impossibly large. She caps the bottle, touches my shoulder, and says, “The Earth thanks you.” She starts to walk away.</p>\n    <p>&nbsp;</p>\n    <p>I stare at the pavement around me, unbelieving. My arms feel full of gravel.</p>\n    <p>&nbsp;</p>\n    <p>“Wait!” I feel myself cry out, staggering to my feet. “Is it a boy or a girl?”</p>\n    <p>&nbsp;</p>\n    <p>The monk looks back at me as if it’s a silly question and I’m not sure she is going to answer.</p>\n    <p>&nbsp;</p>\n    <p>“A girl.”</p>\n    <p>&nbsp;</p>\n    <p>I have a daughter. I have a daughter and she deserves Paradise.</p>\n    <p>&nbsp;</p>\n    <p>I pick up my pickaxe.</p>\n    <p>&nbsp;</p>\n</article>"
      },
      {
        "id": 3,
        "title": "The Extraordinary Adventure of Jacob McMullen",
        "story": "<article>\n    <p>Jacob McMullen was a curious child.</p><p><br></p><p>He had read every book in the family bookshelf including the A-Z and the Dictionary. He knew the proper names of all the creatures that lived in the garden, from the insects to the flowers, and even the clouds.</p><p><br></p><p>Jacob had hundreds of ideas stored in his brain, for rainy days and sunny days and all the days in between. The trouble was, he was not allowed to do <em>any</em> of them<em>. </em></p><p><br></p><p>When he had asked his mother if they could go to the shops, she had said,&nbsp;</p><p><br></p><p>“No, there are too many germs.”</p><p><br></p><p>When he asked to go to the fireworks, she had said,&nbsp;</p><p><br></p><p>“No, there would be too much noise.”&nbsp;</p><p><br></p><p>During the summer holidays, Jacob started to investigate the insects in his garden. He gathered a small array of ants, worms, slugs, and beetles and kept them in old cereal boxes under his bed.</p><p><br></p><p>One sunny afternoon, the screams of his mother echoed through the walls as she stumbled onto his collection.</p><p><br></p><p>“No! Too many bugs!”</p><p><br></p><p>A curious child may listen to No once.</p><p><br></p><p>Possibly twice.</p><p><br></p><p>A third time if they are particularly compliant. But, after hearing too many No’s in their little lifetimes, curious children will eventually stop listening.&nbsp;</p><p><br></p><p>And that is exactly what happened to Jacob McMullen.&nbsp;</p><p><br></p><p>A few weeks after the insect incident, a National Geographic magazine arrived in the post. On the second page a colourful poster advertised the wonders of London Zoo.</p><p><br></p><p>Brimming with excitement, the boy cut out the picture, neatly with his safety scissors, and folded it into his pocket.&nbsp;</p><p><br></p><p>He waited until the weekend to raise the question with his mother. Although he knew she would most likely say No, a small part of him remained hopeful.&nbsp;</p><p><br></p><p>As she poured the milk into her bowl, Ms. McMullen looked up at Jacob and smiled. He seized his opportunity.&nbsp;</p><p><br></p><p>“Mum...Do you think we could go to the Zoo today?”</p><p><br></p><p>His mother sighed, placing her spoon down.</p><p><br></p><p>“I’m so sorry honey. You know we can’t. London is very far away, and it would be too dangerous, anything could happen! When you’re a grown up you will understand.”</p><p><br></p><p>She leaned over and kissed him on the forehead.&nbsp;</p><p><br></p><p>“Home is safe. Let’s stay home, okay?”</p><p><br></p><p>Jacob gave in and hugged her back.&nbsp;</p><p><br></p><p>“Okay. But...can I have pancakes for breakfast then? Pleaaase. Pretty please mum.”</p><p><br></p><p>She nodded, ruffled his hair and headed into the kitchen.&nbsp;</p><p><br></p><p>Now was his chance.&nbsp;</p><p><br></p><p>Jacob tiptoed out of the living room, grabbing the backpack he had hidden behind the shoe rack.</p><p><br></p><p>He paused for a second.</p><p><br></p><p>Once he could hear the familiar whistling tune in the kitchen, he carefully unlatched the front door and left.&nbsp;</p><p><br></p><p>The first part of his journey was easy enough. He had caught the bus many times with his mother and knew that if he stayed on till the end, it would take him to the Station.</p><p><br></p><p>The bus driver frowned a little when the boy stepped onboard, but it was not entirely unusual for young children to take the bus alone.&nbsp;</p><p><br></p><p>When they arrived at the Station, she tried to speak to Jacob, but he had disappeared amongst the masses of people by the time she exited her booth.&nbsp;</p><p><br></p><p>The small boy with the vast mind drifted through the Station following the throng of the crowd. There were so many people and noises and barking dogs and crying babies.</p><p><br></p><p>But Jacob was not scared.&nbsp;</p><p><br></p><p>He had his books, his map and - most importantly - he had his plan.&nbsp;</p><p><br></p><p>That was all he needed.&nbsp;</p><p><br></p><p>THE TRAIN NOW APPROACHING PLATFORM 10 IS THE 09:23 TRAIN TO LONDON KINGS CROSS.</p><p><br></p><p>Jacob adhered the tannoy’s call, quickly locating platform 10. A ticket barrier stood in the way, but he easily slipped through undetected. He boarded the train, found a seat that was not reserved, closed his eyes and waited.&nbsp;</p><p><br></p><p>And waited.&nbsp;</p><p><br></p><p>And waited...</p><p><br></p><p>Eventually, the small boy fell asleep. Although he should have been thinking about his beloved animals in the Zoo, his dreams were plagued with No’s of all shapes and sizes, growing bigger and bigger until —</p><p><br></p><p>HISS.</p><p><br></p><p>The train slowed to a stop. Jacob once again became invisible as the crowd came back to life, buzzing towards the doors, spilling out onto the platform.&nbsp;</p><p><br></p><p>He exited the train and walked through the station until he found an escalator which led to the Underground. Once he had located a map of the train line, he traced his finger along the black Northern line which led him to the Zoo.&nbsp;</p><p><br></p><p>Jacob had studied maps for a long time, so this was a breeze to him. He could not understand <em>why</em> his mother was so scared to leave the house.&nbsp;</p><p><br></p><p>And that is when he made his first mistake.</p><p><br></p><p>(Or second, if you believe that a young child embarking on such a perilous journey was a mistake in itself.)</p><p><br></p><p>Jacob noticed a sign for the restroom and entered. The stall was quite small, so he left his backpack outside of the door whilst he used the toilet.&nbsp;</p><p><br></p><p>No more than two minutes later, he left the cubicle and washed his hands in the sink. When Jacob was about to leave the restroom, he noticed his backpack was no longer where he had left it.&nbsp;</p><p><br></p><p>A small seed of panic started to grow inside the boy. He looked inside all the stalls - holding his nose at a particularly awful cubicle - but his search led to no avail.&nbsp;</p><p><br></p><p>His palms were clammy and when he hurriedly pushed his auburn mop out of his eyes, sweat stained his fringe. Jacob ran out of the stall, frantically searching through the underground ticket station.&nbsp;</p><p><br></p><p>It was impossible.</p><p><br></p><p>There were too many people and noises and rushing feet. His backpack was long gone.&nbsp;</p><p><br></p><p>Although Jacob was a very clever boy, who could tell you the capital of any city or the definition of almost any word, he was still a child. And there was one thing all children did, regardless of their differences.&nbsp;</p><p><br></p><p>He sat on the floor and cried.&nbsp;</p><p><br></p><p>Oh - how he sobbed! Hot tears matted his wild locks and streaked through the dirt on his cheeks.</p><p><br></p><p>His mother was right, he should have stayed home.&nbsp;</p><p><br></p><p>It was not too late to turn back. If he got on the train at King’s Cross, he would make it home in time for dinner…</p><p><br></p><p>No!</p><p><br></p><p>What was he thinking?</p><p><br></p><p>He had made it this far; he could not give up now.</p><p><br></p><p>Jacob McMullen was not going home until he had seen the Zoo.&nbsp;</p><p><br></p><p>Slowly, his tears dried up and he regrouped his thoughts.&nbsp;He did not need his map as almost every wall in London contained some sort of map describing the surrounding area. If he followed the black line, he would eventually make it to the Zoo.&nbsp;</p><p><br></p><p>Jacob wiped his face with the back of his sleeve and took in a deep breath. With all the bravado a small child could muster, he stepped down, onto the escalator.&nbsp;</p><p><br></p><p>Within a few moments, he was onboard the last train he needed to reach his destination.&nbsp;</p><p><br></p><p>His fears were pushed to the back of his mind. Excitement coursed through his body as the boy gripped onto the handrail, swaying with the motion of the train.&nbsp;</p><p><br></p><p>Finally, the train conductor called out the stop and Jacob exited the underground train, climbing up the escalator till he saw an opening into the streets. He ran as fast as his little legs could carry him, knowing that the road would lead him to the Zoo.&nbsp;</p><p><br></p><p>Finally, he saw the entrance.&nbsp;</p><p><br></p><p>A giant sign dominated the street, with colourful balloons waving in the breeze. There was a queue outside, lined with children holding onto their parents with one hand, the other filled with toys or popcorn or sticky globs of candy floss.&nbsp;</p><p><br></p><p>Butterflies swarmed in his tummy as the boy joined the queue, unnoticed.&nbsp;</p><p><br></p><p>Or so he thought.&nbsp;</p><p><br></p><p>However well planned, the fantasies of a small child rarely take into account the role of their parents.&nbsp;</p><p><br></p><p>As soon as his mother had finished making pancakes, she walked into the living room still whistling her favourite tune. Her smile quickly disappeared when she noticed Jacob was not there. Upon discovering that the front door was open, Ms. McMullen ran out into the streets screaming for her lost child.&nbsp;</p><p><br></p><p>Within moments, the police were called and a nationwide search for the boy began.&nbsp;</p><p><br></p><p>And that was why two police officers stood outside the gates of the Zoo looking for a small child with a big plan.&nbsp;</p><p><br></p><p>Jacob remained blissfully ignorant. There were many police officers in London, and he paid no attention to them as he attempted to slip behind a large family with several children in tow.&nbsp;</p><p><br></p><p>He was so close to the gates. The mouth-watering scents from the food stalls wafted into his nostrils causing his empty tummy to rumble in protest.</p><p><br></p><p>The boy took one step forward.</p><p><br></p><p>“YOUNG MAN”, a voice shouted in the distance.&nbsp;</p><p><br></p><p>Jacob was far from being a man, merely a child on the doorstep of Wonderland. But he knew the voice was speaking to him.&nbsp;</p><p><br></p><p>He tried to run inside the gates, but a large burly hand grabbed him by the collar and pulled him away from his dream.&nbsp;</p><p><br></p><p>“Young man! I am speaking to you. Do you have any idea what kind of trouble you are in?”</p><p><br></p><p>Jacob looked up at the scary faces of the officers. His backpack was lost, and so was&nbsp;his map. But everything would have been okay because he had stuck to the plan – he made it here!</p><p><br></p><p>It wasn’t fair!</p><p><br></p><p>Jacob curled up into a small ball and, for the second time that day, started to cry.&nbsp;</p><p><br></p><p>But this time, he was no longer an invisible soul swept amongst the tides of London.&nbsp;</p><p><br></p><p>This time, he was safe.&nbsp;</p><p><br></p><p>He felt a soft hand touch his head, followed by a familiar scent.&nbsp;</p><p><br></p><p>“Oh, Jacob. How on Earth did you make it to the Zoo?”</p><p><br></p><p>The small child uncurled himself and relaxed in the warmth of his mother’s embrace.</p><p><br></p><p>“I had a plan, Mum. And a backpack. But someone took that.” He sniffled.&nbsp;</p><p><br></p><p>She hugged him tightly.&nbsp;</p><p><br></p><p>“Well at least they didn’t take you!”</p><p><br></p><p>One of the police officers stepped forwards and asked if she needed help getting back to the station.&nbsp;</p><p><br></p><p>Ms. McMullen shook her head, smiling.&nbsp;</p><p><br></p><p>“If we were going back, I’m sure Jacob would be able to tell me the way. I have no idea how someone as anxious as me could create such an incredibly brave and clever little boy.”</p><p><br></p><p>She lifted Jacob off the ground.&nbsp;</p><p><br></p><p>“Thank you for your help Officers. He is safe now; you can go back to your headquarters. We have an important matter to attend to.”</p><p><br></p><p>Jacob stared sullenly at the ground as the officers walked away. He knew he deserved a telling off but still did not wish to hear it. Shutting his eyes tightly, he waited for the sharp tones of his mother to pierce through him.&nbsp;</p><p><br></p><p>To his surprise, she stepped towards the gates.&nbsp;</p><p><br></p><p>“Can I have two tickets to the Zoo please.” She asked, reaching into her purse.&nbsp;</p><p><br></p><p>Jacob looked up at his mother, eyes wide in disbelief.&nbsp;</p><p><br></p><p>She smiled and ruffled his hair.&nbsp;</p><p><br></p><p>“You are a very special child, Jacob McMullen. Thank you for bringing me here.”</p><p><br></p><p>And with that, the remarkable boy and his relieved mother embarked on the final stretch of an extraordinary journey.</p><p><br></p>\n</article>"
      },
      {
        "id": 4,
        "title": "Night at the Library",
        "story": "<article>\n    <p>\tShe flicked the lights. Off, on. Off, on. It was the signal, like a bit of morse code for the patrons. Time to leave. </p>\n    <p>\tUnhurriedly, the patrons packed the belongings they had spread across tables and desks. They tucked away snack wrappers that they weren’t supposed to have in the library at all, doing so as discreetly as one can with a crinkly noise maker, crumbs falling on the way and so leaving traces of their minor infractions. They unplugged their electronics, wrapping the cords of their headphones and sliding them into backpacks and bags.</p>\n    <p>\tSomething about closing time made the patrons noisy; it was as if the flicking lights signalled both the impending closing of the library, but also granted permission to speak up about plans to clean the kitchen or grab a coffee with a visiting friend. The noise stirred the books on their metal shelves. The woman tried to fix them with the quintessential over-the-frame-of-her-glasses-look, but they avoided eye contact as they trailed out. She pulled the door shut behind the last patron and locked the door, exhaling deeply before turning off the lights and throwing the library into dark stillness.</p>\n    <p>\tSomeone watching the young woman in the oversized cardigan and big round glasses might assume she was tired from the day. Someone more experienced with the inner workings of the library might see the exhale as the exhaustion that comes from a day of searching the stacks for an elusive, missing call number, keying in search terms for patrons who don’t know what they want, and of course, reminding patrons that not returning their books on time <em>will </em>result in late fees and that yes, they can renew their books online. </p>\n    <p>\tAnd while these observers may have been partially right, it is only the most experienced, the ones bearing the title of Librarian, that truly know the woman’s sigh. </p>\n    <p>\tShe was preparing. For her shift had only just begun. The woman rolled up her sleeves, tightened the ponytail in her hair, and pushed her glasses up her nose. The lenses glinted in the glow of the emergency lights. The stacks sat silent, for now. The woman marched to the reference desk, opening a drawer with one of the keys on her keychain that had MELVERN PUBLIC LIBRARY printed on the lanyard. From the drawer, she pulled a stack of reference cards so old the information had been printed with a typewriter. Each letter had been punched into the cardstock so that it left just the hint of embossed texture on the back side of the card. Of course, other librarians used different weapons these days, but she had been trained with reference cards, and frankly, Melvern was not the forerunner in library technological advances, so she was stuck with the cards. Not that she minded.</p>\n    <p>\tShe pocketed the reference cards, keeping one out, flipping it between her fingers like it was from a deck of cards and she was a magician about to dazzle a crowd with a trick. A small, weary smile tugged at her lips. If only those magicians knew what they were missing. </p>\n    <p>\tShe started her patrol, near the back wall of the library where the 100s were tucked away. Philosophy tended to be a quiet, peaceful section, but a rhythmic thumping told her not all was well in the library this night. She moved through the section quickly, faint whispers about the questions of Form and telos and the good life reaching her ears like a siren’s song. But the last thing she needed was a lecture from Aristotle on the meaning of life. She moved swiftly on. </p>\n    <p>\tShadows jumped and lurked just on the edges of the stacks, moving across her periphery vision. Behind her, the metal of the shelf groaned. She dared not turn her head, but her fingers tightened around the edges of the reference card, and she reached for another from her pocket. </p>\n    <p>\tParents told children that nothing lurked in the shadows, and while that may be true for closets and bedrooms, it is not so in the stacks of books dense with stories and knowledge. The key in the library was strategy. Which shadows ought one chase? Not those in the 100s, 200s, or even 300s. Important as they were, those shadows rarely meant harm. They only wanted attention, undivided and focussed attention. But she needed her focus elsewhere. The thump sounded again, and she stepped lightly around the edge of one of the rows into the 400s. A soft babble filled her ears, and she picked up three, four, perhaps six languages staking their claim to the limited shelf space. So far, nothing was amiss here. Then she froze, holding a breath she had been ready to exhale in relief.</p>\n    <p>\tThrough the multilingual murmurs she could make out a faint, but persistent sound. It wobbled and wavered, sometimes so quiet she was tempted to think it her imagination. She inched forward. The sound of the 400s blocking out the danger she knew was coming. Her feet padded gently on the carpet and were nearly silent from years of training. She turned the corner, pressing her back against the shelf that proclaimed she was approaching the 500s—Natural Sciences.</p>\n    <p>\tSlowly, carefully, and without letting out a breath, she peered around the corner. Her heart hammering in her chest just as loud and with the same rhythm of the distant thumping. Her eyes widened. And golden eyes glinted back. Tiger. A vague question resounded in the back of her mind, but how had it escaped? A quick scan of the floor answered her question. A brightly coloured copy of <em>The Children’s Encyclopedia of Big Cats </em>lay open on the floor. And next to it, a small child clutching her knees and whimpering softly. </p>\n    <p>\tThe woman stepped forward, the tiger growled, and the girl choked through a sob. She looked up when the woman crouched down to her level, her keys clinking together. The woman put a finger to her lips. The girl nodded, trying to catch her breath between sobs. The tiger growled again and pounced. The woman leapt, scooping up the book as she jumped between the girl and the tiger.</p>\n    <p>\tThe girl screamed.</p>\n    <p>\tThe young woman turned and clamped a hand over the girl’s mouth, shushing her with a hiss. The girl’s eyes widened, and she strained to see the empty aisle where the tiger had been only a second earlier.</p>\n    <p>\t“The tiger’s back where he belongs,” the woman whispered, pointing to the closed encyclopedia on the floor. “We need to keep moving. Everything will be awake now.”</p>\n    <p>\t“Where’s my mommy?” the little girl asked, and the woman cringed at the pitch and volume of the question. </p>\n    <p>\t“Was she in the library with you?” the woman asked.</p>\n    <p>\tThe little girl shrugged. “I don’t know.”</p>\n    <p>\tThe woman ground her teeth, her ears perking at the sound of ripping, snarling, thumping, and quite possibly an armoured horse a few rows down from where they were. “On my back, now. It’s not safe here. We need to keep moving.”</p>\n    <p>\tThe girl didn’t protest, but once she was holding tightly around the woman’s neck, she whispered. “What about my backpack?”</p>\n    <p>\t“You will have to get it from the lost and found tomorrow,” the woman said, internally groaning at the thought of searching through <em>The Children’s Encyclopedia of Big Cats </em>to find the lost bag. </p>\n    <p>\tA horse, or ten of them from the sound of it, whinnied behind them. “Time to go!” </p>\n    <p>\tThe woman ran through the stack, no longer carefully padding her steps in silence; there was no need anymore. Anything that could escape had the moment the girl had screamed. The woman pulled the cards out of her pocket as they went. She handed one behind her to the girl.</p>\n    <p>\t“Throw that at anything that moves,” she whispered, hoisting the girl higher onto her back.</p>\n    <p>\t“But it’s just paper,” the girl protested.</p>\n    <p>\t“Just do—” her command was cut off when something large slithered across the end of the stack they were nearing. It lifted huge wings, knocking into the nearby shelves.</p>\n    <p>\tThe woman’s eyes widened, and she caught the nearest book as it was about to fall. She glanced at the cover, <em>Creatures of Myth and Legend in Fantasy. </em>They had entered the most dangerous section of all—Literature. </p>\n    <p>\t“Is that a snake?” the girl whispered, and the creature turned at her voice, its head entering the faint glow of the emergency light revealing scales, huge teeth, and golden glinting eyes.</p>\n    <p>\t“No,” the woman breathed. “It’s a dragon.”</p>\n    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;She drew her cards and threw them like daggers at the dragon. The cards bounced off the armoured hide of the beast. It roared and tried to stick its head into the stack, huge jaws snapping inches from where the woman and the girl were standing. The woman turned on her heel and bolted back the way they had come as the dragon pushed the shelves, causing a domino effect for the rest of the stacks in the 800 section.</p>\n    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The girl screamed again, but this time the woman didn’t shush her. Noise was no longer a factor. They needed to get out. She hoisted the girl on her back again, the weight of the child bearing down on her. Then she bolted. </p>\n    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;On another night, she might have a chance to stave off the dragon, restore the parading knights on their horses back to their books, and foil the plots of the escape artists in the 800s. On another night, her reference cards could halt any creature, small or big in its tracks. On another night, maybe, but tonight with the girl whimpering on her back and the very real possibility that the girl’s mother was somewhere in the library, the woman stood no chance. Escape was the only option. </p>\n    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Around them the sounds of battle raged. The knights had found the dragon and were charging the creature even as the bookshelves toppled around them. The woman moved in the commotion. A riderless horse ran in their direction and the woman flicked a card as it passed, stopping the creature mid step. She shifted the girl off her back and onto the horse before straddling the saddle herself. </p>\n    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“Hold on tight,” she whispered, plucking the card from the horse’s mane. </p>\n    <p>\tThe horse was reanimated instantly and the three of them took off at a gallop toward the red glowing exit sign leaving the chaos of the 800s behind them. The woman stole a glance behind her. Where was the girl’s mother?</p>\n    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“Mommy!” the girl shouted.</p>\n    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The woman searched the chaos of the Literature section. She could see nothing.</p>\n    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“No! Over there!” The girl tugged on the woman’s shirt, turning her attention back to the exit. </p>\n    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The woman heard before she saw. The thumping. The thumping she had heard since the beginning of her night. She thought it had been one of the books. But it was the mother, banging on the locked door to the library because her daughter had been left inside.</p>\n    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The woman pulled the horse to stop, sticking a reference card between its ears. She dismounted and pulled the girl off the frozen horse. </p>\n    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“Your mom is just outside that door. Push the door open and go home.” The woman said.</p>\n    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The little girl’s lip quivered, and her eyes welled with tears. “But—”</p>\n    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The woman smiled and put a finger to her lips, shushing softly. “It will be okay. Go to your mom.”</p>\n    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The girl was convinced and ran to the door, pushing against it until the mother could pull it open. She wrapped her arms around her daughter.</p>\n    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“Sorry!” she called, her voice echoing across the distance.</p>\n    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The woman cringed at the sound, simply waving as the mother and daughter left and the door clicked behind them, locking them out, and locking the books and everything in them, inside the building. The woman turned to face the library. She pushed her glasses back up her nose and pulled a handful of reference cards from her pocket. Now the real work could begin. &nbsp;&nbsp;</p>\n</article>"
      },
      {
        "id": 5,
        "title": "Momo's Adventure",
        "story": "<article>\n    <p>Casey’s eyes were glued on the ferocious animal in front of her, heart beating wildly as she lay frozen in the tall, dry grass. From between the blades she watched the beautiful leopard placidly groom itself in the sun rays. Casey wished she was close enough to feel the deep throated purring, but didn’t dare move. “Look, Momo,” she whispered to her friend laying next to her.&nbsp; After a pause she huffed, “Of course it’s not a cheetah, silly. They have solid spots. Look at its coat. Hollow spots, not solid.” The stuffed lemur made no reply.</p>\n    <p>Casey cupped her hands around her eyes like binoculars and contemplated her next move. Before she could come up with a plan, the cat suddenly pounced towards a scurrying critter Casey couldn’t see. Both predator and prey darted and dashed around the field before both scurried up the nearby tree and out of Casey’s view. Casey imagined what it would be like to be that prey, how scared and alone it must be. “You know Momo, it’s kind of sad that the prey gets caught alone.” She gave a sigh as she stood up with the lemur dangling in her hand. “Maybe if it had more friends… then life wouldn’t be so scary. Then someone could be like a lookout or back up!” She looked down to the lemur and nodded. “I know... you’re my backup. Just like I’m yours!”</p>\n    <p> </p>\n    <p>Casey stood in the hot sun, sweat starting to bead on her forehead. “Okay, the boss wants us to deliver our package before noon which is when the sun reaches the highest point in the sky.” She tilted her head to the sky to read the sun’s position, then stealthily snuck a peak at her Hello Kitty watch. “C’mon Momo, we don’t have much time!” She took off down the path, her precious cargo bouncing in the bag on her back, Momo swinging wildly in her grip.</p>\n    <p> </p>\n    <p>Casey and lemur stopped at the edge of a big field on the edge of the park. “Look at this grassland. We must be in the savanna!” She looked out over the field seeing a plethora of animals. “Wow Momo, look at the elephants and zebras. Maybe we’ll see a gazelle.” She put Momo down and grabbed her water bottle from the side of her bag. She tilted the bottle over Momo’s mouth. She then removed the cap and took a sip, the cool water sliding down her parched throat. “No you can’t have more, we have to save it. It’s still a long journey.” She stared at the yellow button eyes. “I know this isn’t easy. But someone’s gotta do it.” She screwed the cap back on and slid the bottle back into its sleeve. “What do you mean I dragged you into this?”</p>\n    <p> </p>\n    <p>Casey chatted with the lemur as she walked along the field but stopped talking when she heard noise coming from around the fence ahead. She swallowed hard and slowly peered around the corner, careful to be quiet. She saw four boys playing with a small animal. “Look Momo,” she whispered. “Poachers!” She watched them toss a stick around the small gray animal. “They are hunting that poor baby rhino!” She watched the small french bulldog jump around between the boys chasing after the stick. Then Casey looked at the face of one of the boys. “Oh no! It’s our arch nemesis. David the Destroyer.” She glared at the boy then stuck her tongue out. She threw Momo out then pulled him back in. “No, Momo! We can’t just go after him. We are outnumbered.” She reached around and felt her bag. “Besides, this isn’t the mission.”</p>\n    <p> </p>\n    <p>Casey began walking away when a boy yelled out, “Hey Casey!” She gasped and started to run away. “He’ll ruin our mission!” Casey ran along the fence until she found four scooters laying around. She grabbed the one she recognized and blasted off down the path leaving her nemesis calling after her.&nbsp;</p>\n    <p> </p>\n    <p>Casey came to a stop when her heart couldn’t take any more and her lungs were burning from her dramatic escape; but she forgot all of it when she saw the challenge before her. “Look Momo. A maze of physical tests to keep anyone out of the temple. We will have to be tough.” She dropped the scooter at the edge of the park and raced towards her first challenge - the monkey bars. “Hold onto me Momo!” She strapped the lemur’s arms around her as she jumped up and gripped the hot metal. The hardest part was taking a hand off to reach for the next bar. She tried not to look down as she timed her swinging. <em>Not yet,</em> she thought, straining against her grip. <em>Now! </em>&nbsp;She boldly reached out, grabbed the next one and secured a solid grip, swung back a bit then launched her other hand onto the same bar. Casey slowly, painfully, made her way across the bars, hands burning from refusing to let her fall.&nbsp;</p>\n    <p> </p>\n    <p>When she reached the end, she dropped back down and looked back. “Phew! That could have been a deadly fall! You should keep holding onto me, I’ll get us through the rest.” Casey climbed up colourful towers and slid down chutes, she jumped over and ducked under obstacles until she faced a harrowing threat. “Ok, Momo. If I can avoid these four swinging boulders, it’s a clear shot to the temple.”&nbsp;</p>\n    <p> </p>\n    <p>Casey stared across the path along the swingset, transforming the four kids into hardened rocks. Her eyes followed the swing in front of her, she darted through its path safely, narrowingly missing the next one as it swung in front of her. The laughter and chatter around her dissolved into jungle noises of bird and insect calls. She swung around and danced in time to the swaying, nimbly jumping across the grooves. Suddenly a heavy weight hit her on her back, throwing her and Momo to the ground. The kid scrambled off the swing and raced to Casey who was sprawled on the ground. “Are you okay? I didn’t see you!” The young boy reached a hand down to Casey who was dazed from the blow as much as the hit of reality. Casey kept her gaze down as she slowly sat up. She nodded shyly to the kid, then suddenly swooped up Momo and ran to the end of the park before the kid could react.&nbsp;</p>\n    <p> </p>\n    <p>Casey held Momo close to her chest as she fought back tears. “That was a close one Momo. We … we were almost captured…” her mind scrambled for an escape, “... by that bandit.” She looked back to the swing set and saw swaying boulders once more. The bandit stood there watching her. “C’mon, we better hurry.” Casey turned and raced across the bare land leading up the entrance of the temple.&nbsp;</p>\n    <p> </p>\n    <p>When she got closer, two people emerged from the entrance so she darted into the bushes along the wall to avoid being seen. “That was close. There are guards everywhere! We need to watch our backs.” She snuck along the wall of the building and the bushes covering the front garden. When she saw the entrance was clear she came out and faced two large wooden doors. “Ok Momo, here we go.” She reached out and half-heartedly pulled on the heavy door. “Oh no! There must be a secret code or something!” She held the lemur up as she looked around. “Good eyes Momo!” She took a few steps across the path and saw a post sitting on the edge of a bush. “Wow, look at this insignia! A person sitting on half a circle… hmmm.” She rubbed at her chin. “It must be a symbol of the temple’s god!” She reached out and pushed the button. The doors clicked and slowly swung open. “Yay! We did it!”&nbsp;</p>\n    <p> </p>\n    <p>Casey raced inside the temple, heart thundering. The smell of old books and dust was a comfort to her. It felt like a welcoming hug from all her imagined friends and adventures. Casey stalked through the front entrance, cautious to avoid the view of anyone who was murmuring ahead. “In order to complete our mission, we have to face the keeper of the temple.” Casey squatted down beside a bench and took off her backpack. She carefully removed her precious cargo, zipped up the empty bag and swung it back over her shoulder. “Stay close to me.” Casey took a deep breath, stood up and walked to the front desk.</p>\n    <p> </p>\n    <p>It was as if a cloud had cleared from Casey’s mind. Suddenly she was aware of being in the library. The temple was gone, replaced by rows of wooden bookshelves piled high. People were mulling around or sitting at desks. She became aware of the noise around her, growing louder until it felt overwhelming. Ahead of her was the front desk with the clerk watching her patiently. She could feel her heart pound against her ribs as true fear pinned her to the ground with the man’s clear blue gaze solely on her. Her grip tightened on her stuffed animal and she tried to swallow with her dry mouth.</p>\n    <p> </p>\n    <p>“Hello there,” said the middle aged man at the desk. “Can I help you with something?” Casey stood frozen to the ground, a whooshing sound filling her ears. The clerk smiled and looked down at her hands. “Are you here to return those books?” He asked nicely. Casey nodded stiffly, feeling every vertebrae move at the forced movement. The clerk kept smiling and reached over the desk to her. Casey stepped towards him very slowly and held out her books. The clerk took them gently and read the titles. “Oh, a very nice read. Tomb Raider is an amazing story, especially for a young girl like you. And let’s see… Animals of the Serengeti. Another amazing find.” He fished around under his desk and pulled out two slips of paper while Casey stood there frozen. Her heart began to hurt at the strain. She gripped Momo tighter to her chest. He stamped both slips before he opened the books and returned the paper sheet to the proper book. “There we go. You are all set little lady. Would you like to pick out some more books?” Casey’s eyes widened as he looked back at her. Her breath quickened as she shook her head quickly then darted down the hallway, through the heavy door and back out into the parking lot.&nbsp;</p>\n    <p> </p>\n    <p>“That was a close one Momo. Too bad we couldn’t get more books” She hugged her toy to her chest and started walking home. “Yeah, you’re right, maybe next time.” She passed the playground with the swings and the jungle gym. She walked by the big field where some kids were playing ball. Finally past her neighbour’s yard where the tabby cat was still grooming itself by the tree. She walked passed the scooter she stole and up the steps but stopped when she heard her parents through the screen door. “ - wasn’t ready for this,” her mom said sternly. “She is too young, too fragile.” Her dad’s deep voice was calm as he responded. “She’ll be fine. She’s probably not back yet ‘cuz she’s… hanging out in her own world. You know her.”&nbsp;</p>\n    <p> </p>\n    <p>“Yes, I do know her and her worlds. I told you we can’t keep letting her read like she does if it only makes things worse. She needs <em>friends</em> and kids in her life!”&nbsp;</p>\n    <p> </p>\n    <p>Casey kept her hand on the door handle, listening. Her heart dropped to her stomach. They can’t take her books away, they are all she has.</p>\n    <p> </p>\n    <p>“You worry too much. She’s just a kid.”</p>\n    <p> </p>\n    <p>“A kid who doesn’t talk! Except to that stuffed thing she lugs around everywhere. You shouldn’t have let her go off by herself.”</p>\n    <p> </p>\n    <p>“So you want her to be grown up enough to socialize but not walk three blocks to the library?” Casey could hear her dad’s frustration growing.</p>\n    <p> </p>\n    <p>“I want her to be normal. To be happy.”</p>\n    <p> </p>\n    <p>Casey peeked into the house through the screen and saw her dad hug her mom. His voice was a little muffled as he responded, “What makes you think she isn’t?”</p>\n    <p> </p>\n    <p>Before her mom could reply, Casey pulled open the screen door and rushed inside. Both adults turned to her as she entered the room. She gave her parents a huge smile and ran up to them. “Heya there champ!” Her dad said as he leaned down for the hug she rushed at him. “Did you have fun on your secret mission?” Casey kept her arms around him, looked up and nodded enthusiastically.&nbsp;</p>\n    <p> </p>\n    <p>Just then, barking came from the other room as a small, gray french bulldog came bounding up to Casey followed by her arch nemesis. “Hey twerp!” Casey stuck out her chest and faced David head on, but he only smiled and scuffed up her hair. ”Next time you wanna steal my scooter, maybe don’t leave it less than a block away from the scene of the crime.” David said jokingly as he went into the kitchen.</p>\n    <p> </p>\n    <p>Casey faced her parents again then rubbed the jumping dog, pretending it was a baby rhino. “So, did you accomplish your secret mission?” Her dad asked, sitting down next to her and petting the dog with her. Casey looked at her dad’s smiling face, then her mom’s look of concern as a thought occurred to her.</p>\n    <p> </p>\n    <p>Reality was really scary sometimes, but just like in her adventures, as long as you have someone there as back up- someone who believes in you - maybe everything will work out.&nbsp;</p>\n    <p> </p>\n    <p>A small smile came to her lips and she said, “Yes, we did.”</p>\n    <p> </p>\n    <p> </p>\n    <p> </p>\n</article>"
      }
    ]
  },
  {
    "id": 2,
    "category": "Crime",
    "image": "assets/images/crime.jpeg",
    "stories": [
      {
        "id": 1,
        "title": "The Eyes In The Forest",
        "story": "<article><p>The forest was bright and warm, the sunlight dappled across the leaf-covered ground in a way that evoked images of autumn holiday brochures and children laughing. There was a slight breeze rustling the upper branches, but down at ground level all it did was bring the warmth of the sun in from out in the meadows all around. For everyone not working, it was a weekend to head out and make the most of the last of summer, before the cold settled in.</p>\n    <p> </p>\n    <p>It was, I thought, a terrible place for a murder scene.</p>\n    <p> </p>\n    <p>“All right Andrews?” my boss asked as he came over. Despite the fair weather he was still clutching a take-out cup of coffee like a lifeline, and I could smell the alcohol from whatever he’d been doing last night.</p>\n    <p> </p>\n    <p>“All right, sir. I didn’t think you were on duty today?” Judging by the state of Detective Matthews, neither had he. However reckless he was on his night’s off, Matthews was a consummate professional out in the field, when the public could see him.</p>\n    <p> </p>\n    <p>“Huh, tell me about it. But, four bodies in three months. No one gets their Saturdays when that happens.”</p>\n    <p> </p>\n    <p>Some of us didn’t have many Saturdays anyway, but I only gave him a tight smile in response. It wasn’t right to bitch about hours and shift patterns when there was a dead body in the vicinity.</p>\n    <p> </p>\n    <p>Another car pulled up into the cordoned off area and Matthews turned to watch it. It wasn’t a vehicle I recognised, but I wouldn’t have considered myself an expert on the department’s cars. Besides, four bodies in three months. This was when the top brass got called in, and all the specialists scraped up from wherever they usually lurked.</p>\n    <p> </p>\n    <p>Matthews was having the same thought. “More god-damn people sticking their noses in, telling me what to do…” He walked back over to the ‘car park’ still muttering, leaving me to my solo guard duty. The investigators would go over the area first, then maybe I’d get called in to help sweep the area. Until then my contribution to catching a murderer was to stand still and keep people away. Of course, to get to me they’d have already had to get through two other police cordons. I was nothing more than window dressing at this stage, but the more serious the crime, the more window dressing the bosses wanted. Couldn’t let the press take a photo of empty space now, could we?</p>\n    <p> </p>\n    <p>Whoever had just turned up seemed to causing something of a stir with the other detectives. They all had more sense than to start shouting, but I recognised the way Matthews had started pacing. A few words drifted across the forest to me, though I didn’t get much other than tone. No one was happy about the new person turning up, and I wondered what sort of specialist would cause such a stink.</p>\n    <p> </p>\n    <p>Maybe it’s our own Sherlock Holmes, I thought to myself with a snort. It would make the shift more interesting at least, but there was no way that Sherlock Holmes would work with a modern policing system. All those deductions and assumptions? The evidence courts would be laughing themselves to death.</p>\n    <p> </p>\n    <p>The new arrival was coming my way. I wiped the smirk from my face and stood up a little straighter, staring dead ahead as I watched them out the corner of my eye. Smart suit, skinny glasses, slightly crocked tie, and far younger than I’d expected for a specialist. At a guess I’d put the man at a few years older than me, early thirties or so, although he could just have had one of those faces that ages well. His height didn’t help, and though the ground was uneven he was about eye level with me when he stopped.</p>\n    <p> </p>\n    <p>“Officer Andrews?” he asked, scanning me up and down. I’d braced for this moment – who doesn’t love a woman in uniform? – but there was nothing to his look. It was more like he was trying to read my name on my legs, rather than checking out any curve they may or may not have had.</p>\n    <p> </p>\n    <p>“Yes, sir.” Even though he was nameless, anyone out of uniform at a crime scene was pretty much guaranteed to be my superior. Better safe than sorry.</p>\n    <p> </p>\n    <p>“Can you take me down to the crime scene, please?”</p>\n    <p> </p>\n    <p>“One moment, sir.” I’d barely tapped the call button on my radio before Matthews started waving his arm at me and giving the thumbs up. I tried to nod back, though he didn’t watch long enough to see. “Right this way, sir.”</p>\n    <p> </p>\n    <p>I led the way through the trees to where the body had been found, all the while fighting down the urge to kick the leaves as I went. Precise placement wasn’t worth preserving when the leaves were so light and likely to move naturally, but it was hardly very professional. We came round one particularly large tree – meant to keep the victim out of sight, we figured – and there she was. No name, no purse, no shoes, clothing torn…</p>\n    <p> </p>\n    <p>Despite the warm air I shivered. There was no getting used to this bit.</p>\n    <p> </p>\n    <p>“Here, sir,” I said. It was obvious, but it didn’t feel right to just wave and go ‘ta-da’. Poor woman needed some respect in death, even if she didn’t get any in life.</p>\n    <p> </p>\n    <p>“Thank you, um, Andrews. You can go back to your post now.”</p>\n    <p> </p>\n    <p>“Are you sure… sir?” Solo investigation, seriously? And I hadn’t even gotten the man’s name, let alone his rank or speciality. But Matthews had waved me on. If this went wrong I could pin the blame on him, right? No, that was childish.</p>\n    <p> </p>\n    <p>“I’m sure. Thank you.” As he dismissed me he knelt down by the body and started looking at it, leaving me to walk away.</p>\n    <p> </p>\n    <p>I turned back half a dozen times, but he didn’t seem to be doing anything. Just staring. Waiting, perhaps. But then what for, me to leave? My stomach tied itself in knots and I looked at the dead woman’s face. I didn’t like leaving her here alone with him.</p>\n    <p> </p>\n    <p>Rank left me with no option though. I dragged my heavy feet back to where I’d been standing, and was grateful to see that Matthews had wandered closer again.</p>\n    <p> </p>\n    <p>“Sir?” I said as I came up behind him.</p>\n    <p> </p>\n    <p>“What’s up?” he asked. Despite the coffee cup hanging empty in his fingers he looked rougher than he had earlier. Whoever the stranger with the body was, he sure could rile people up.</p>\n    <p> </p>\n    <p>“Am I good to leave him alone, sir? Only protocol and all…”</p>\n    <p> </p>\n    <p>Matthews snorted. “Ha, protocol. Some fancy arse from god-knows-where rocks up and suddenly we’re ignoring it. Yeah yeah, it’s fine, Andrews. He’s got special dispensation.”</p>\n    <p> </p>\n    <p>Curiosity got the better of me. “How come?”</p>\n    <p> </p>\n    <p>“Because of his impeccable completion rate. Solved more crimes than half of our department by all accounts, so the sun shines from him and we all have to bend over and worship. Damn it, if I knew we’d be standing around with our thumbs up our arses I’d have gone and gotten another coffee.”</p>\n    <p> </p>\n    <p>I bit back all my opinions on what that would do for the twitch under his eye and watched as he walked away again. Curiosity was still burning inside me. ‘Impeccable completion rate’? What did that even mean? And if he worked alone, did that mean he had some secret technique for solving crimes?</p>\n    <p> </p>\n    <p>I headed back to my post, but when I got there I checked over my shoulder. No one was watching, not that they had any reason to. All the detectives were huddled together, all complaining judging by the way they folded their arms or put their hands on their hips. They really were quite a melodramatic lot. The other uniforms about were scanning the area, sorting paperwork, checking maps, milling about, trying to look useful. There was no telling when a camera could appear.</p>\n    <p> </p>\n    <p>I slipped past my spot and re-traced my steps back to the body. There couldn’t be some secret technique for solving crimes, so what exactly was that guy doing? I had to know, and I had to know that it wasn’t anything dodgy. Even with clearance from the boss, I’d brought the man out here and I’d left him here. He was my responsibility.</p>\n    <p> </p>\n    <p>Between the crispy leaves and my full uniform it was hard to sneak, but I did the best I could until I got to a nearby tree. From there I could lean round and watch the guy work. It took me a few moments and lots of blinking before I registered what I was seeing.</p>\n    <p> </p>\n    <p>The man was crouched on the ground where I’d left him, but he wasn’t looking at the woman. He was focused on the pair of squirrels sat across from him, on the other side of the corpse. Too add insult to injury, he was talking to them.</p>\n    <p> </p>\n    <p>“So it wasn’t an attack here? This was just a body dump?”</p>\n    <p> </p>\n    <p>My shoulders slumped. A great detective, wonderful record, and his secret technique was explaining things to animals? My brother would talk out programming problems to his dog, but this was just ridiculous. At least no one else saw my brother doing that, and at least he wasn’t doing it for a murder enquiry.</p>\n    <p> </p>\n    <p>“Yeah. The man knew her, was crying the whole time.”</p>\n    <p> </p>\n    <p>I froze at the other voice. There was no way…</p>\n    <p> </p>\n    <p>“Did he say anything?” the detective asked.</p>\n    <p> </p>\n    <p>“Yeah,” the squirrel – <em>the squirrel!</em> – replied. “Kept apologising, saying it was an accident. ‘I’m sorry, I’m sorry’, that sort of thing.”</p>\n    <p> </p>\n    <p>“And then what?”</p>\n    <p> </p>\n    <p>“He took her shoes,” the other <em>god damn squirrel</em> said. “Then he ripped her shirt, rumpled her clothes and all. She was properly dressed before she got here. He did all that here.”</p>\n    <p> </p>\n    <p>“Anything else?”</p>\n    <p> </p>\n    <p>“Don’t think so. That all you need?”</p>\n    <p> </p>\n    <p>“Yes, thank you. That’s most helpful.” The detective smiled and nodded at the squirrels before they turned and scurried away.</p>\n    <p> </p>\n    <p>My eyes were dry from the non-blinking staring and I ran a hand across my face. There was no way I just saw that. Had Matthews infected me with his hangover?</p>\n    <p> </p>\n    <p>The detective pulled out his notebook and jotted down some notes, before he looked up and round the clearing. I only just ducked back behind the tree in time.</p>\n    <p> </p>\n    <p>“Is there anyone else?” he said, just loud enough to carry, but not enough to reach back to where the other officers were. Heaven forbid they see him talking to the animals.</p>\n    <p> </p>\n    <p>On cue a mouse scurried up and perched on a branch sticking out of the leaves. “Yes,” it said.</p>\n    <p> </p>\n    <p>“And what did you see?”</p>\n    <p> </p>\n    <p>\"See, not much. But they smelt the same, her and the one who brought her.”</p>\n    <p> </p>\n    <p>“Exactly the same? Like, they lived together?”</p>\n    <p> </p>\n    <p>“Just so.”</p>\n    <p> </p>\n    <p>“Thank you. Anything else?”</p>\n    <p> </p>\n    <p>“No. Don’t see much I’m afraid.”</p>\n    <p> </p>\n    <p>“No worries. Thank you for your help anyway.”</p>\n    <p> </p>\n    <p>The mouse scurried away as the detective made more notes, and the last strand of my sanity snapped. I stormed out from my hiding space, oblivious to the fact I was marching through a crime scene.</p>\n    <p> </p>\n    <p>\"All right, what the hell is going on?” I said.</p>\n    <p> </p>\n    <p>The detective jumped to his feet, guilty as though he’d killed the woman, before a carefully schooled expression took over. “I am investigating this murder, officer. You should be back at your post–”</p>\n    <p> </p>\n    <p>“No! None of that! What the hell is happening? How the hell are the animals <em>talking?</em> And why the hell are you so calm about it?”</p>\n    <p> </p>\n    <p>“Miss, I can assure you–” He cut off mid-sentence and stared at me, as though I was the weird one in this scenario. “Hang on, talking?”</p>\n    <p> </p>\n    <p>“Don’t pull that crap with me, I saw you taking notes, you heard them–”</p>\n    <p> </p>\n    <p>“But so did you. You heard the animals talking?”</p>\n    <p> </p>\n    <p>“Yes! But how?”</p>\n    <p> </p>\n    <p>He ignored the anguish in my voice and just kept staring. I was halfway through weighing up whether to just punch him (assaulting a superior, and how would I explain why?) when he broke into huge grin. I hadn’t realised how morose he’d looked before, and I blushed at the sheer childlike joy on his face.</p>\n    <p> </p>\n    <p>“I’ve never met anyone else like this before,” he whispered. “Hey, prove it. Mouse! Come back.”</p>\n    <p> </p>\n    <p>The mouse scurried up again, though it shuffled away when it saw me. “Yes?”</p>\n    <p> </p>\n    <p>The detective spun to me and nodded. “Go on. Talk to it.”</p>\n    <p> </p>\n    <p>“Um,” I said. Would this count as playing along, or was I loosing my mind as well? For the first time in my life, I wanted nothing more than to be on guard duty. “Hello… mouse?”</p>\n    <p> </p>\n    <p>“Greetings,” the mouse said with a little bow. I shook my head. I wasn’t bowing to a mouse.</p>\n    <p> </p>\n    <p>“Yes, fine, greetings. Are we done now?” I asked the detective. “Because I am currently talking to a mouse, and I would like some explanations.”</p>\n    <p> </p>\n    <p>“One more thing,” he said. “Ask it about the weather.”</p>\n    <p> </p>\n    <p>“Are you for real, right now?”</p>\n    <p> </p>\n    <p>“Just do it.”</p>\n    <p> </p>\n    <p>I rolled my eyes, but academy training was hard to kick. Someone says jump, you ask how high. Or ask after the weather. “How’s the weather?” I said to the mouse with a wild grin on my face.</p>\n    <p> </p>\n    <p>“Fair,” the mouse replied. “The leaves are falling early this year, but the rain has stayed off for now.”</p>\n    <p> </p>\n    <p>“Great.”</p>\n    <p> </p>\n    <p>The detective took a step towards me and peered at my face. “What did he say?”</p>\n    <p> </p>\n    <p>“You heard what it said–”</p>\n    <p> </p>\n    <p>“No, you tell me. Repeat what the mouse said.”</p>\n    <p> </p>\n    <p>Shaking my head at the stupidity of the statement I did as I was told. “The leaves are falling early, but the rain has stayed off for now. Is that it, are we done with this madness now?”</p>\n    <p> </p>\n    <p>“You really did hear it.”</p>\n    <p> </p>\n    <p>\"Yes. I told you that.”</p>\n    <p> </p>\n    <p>“Yes, I’m sorry. I just had to make sure that you weren’t lying.”</p>\n    <p> </p>\n    <p>All sense of decorum went out the window. “Look, mate, of all the things I’m going to lie about, ‘I can hear mice complain about the weather’ isn’t one of them.”</p>\n    <p> </p>\n    <p>The detective ran a hand across his hair and smiled sheepishly. “Yeah. Guess not. I’m sorry, like I said, I’ve never met anyone else who can do this. I had to be sure.”</p>\n    <p> </p>\n    <p>“But, you know, <em>how</em>? How are we hearing animals talk?”</p>\n    <p> </p>\n    <p>“No idea. I’ve never found any explanation, or even a suggestion that it’s happened before.”</p>\n    <p> </p>\n    <p>“Then how…”</p>\n    <p> </p>\n    <p>“Did I discover it? I used to do it as a kid, but then I figured it was just something wrong with my head. One day I got fed up at a crime scene, saw a squirrel and asked for help, and it led me right to wear the stolen goods had been stashed. Insurance fraud, and I proved it in about ten minutes. From there it just kind of grew.”</p>\n    <p> </p>\n    <p>“So what, you’re Detective Inspector Dolittle?”</p>\n    <p> </p>\n    <p>He laughed and looked even younger as years of secrets drifted away from him. “Something like that I guess.”</p>\n    <p> </p>\n    <p>“What happened here then?”</p>\n    <p> </p>\n    <p>He looked down at the body and the smile dropped. “Accidental death, deliberate dumping. She died in her home, I reckon, maybe a fight, maybe sheer unhappy chance. Her partner panicked, knew about all the murders out here, so came and dumped her here. Maybe he’s got a record or something. But I’ve got a registration number for the car, so we can go and check it out. By the sounds of it he’s feeling guilty, so it shouldn’t take long to push him to a confession.”</p>\n    <p> </p>\n    <p>I had been nodding along, till I fixated on one word. “We?”</p>\n    <p> </p>\n    <p>He looked back at me and blushed. “I thought so. I mean, I could use a hand working all these cases, and you can work the same way as me.”</p>\n    <p> </p>\n    <p>“Hold on. You mean, become a detective?”</p>\n    <p> </p>\n    <p>“Don’t you want to?”</p>\n    <p> </p>\n    <p>“I mean…” In truth I hadn’t thought about it until then. My eyes fell to the corpse again. How many things had she been planning to do, or put off doing? I had to swallow the lump out my throat before I could answer though. “All right. I’m in. Assuming you can sort it with the boss.”</p>\n    <p> </p>\n    <p>The detective grinned at me. “I have a lot of pull. I can figure something out.” He stuck his hand out, which I took. “Detective Inspector Christopher Griffiths.”</p>\n    <p> </p>\n    <p>“Officer Iris Andrews.”</p>\n    <p> </p>\n    <p>“A pleasure to meet you, Iris. Now, let’s go talk to a murderer, shall we?”</p>\n</article>"
      },
      {
        "id": 2,
        "title": "Murder at Ex-Ir Con",
        "story": "<article><p>The Extreme Ironing Convention was infamous in Preston.&nbsp; For the last eight years, extreme ironers from around the world fell upon the city.&nbsp; Their antics in the streets caused emergency calls for days.&nbsp; Ironing on top of city buses.&nbsp; Ironing while hang-gliding over downtown.&nbsp; Ironing while belaying down the cupola of City Hall.&nbsp; Every year, there was one incident that truly left its mark on Preston. This year, the incident would be the death of Shawn Morrison.</p>\n    <p> </p>\n    <p>I looked down at Shawn’s body, his face brutalized by a blunt object.&nbsp; In any other situation, identifying the murder weapon might have been tricky, but not here.&nbsp; Not at Ex-Ir Con.</p>\n    <p> </p>\n    <p>There was no mistaking the iron-shaped dent in the dead man’s head.&nbsp; I had seen it before.&nbsp; I clenched my fists, remembering the day that my wife had been murdered eight years ago.&nbsp; The image of her face haunted my nightmares, beautiful until it had been ruined by a Bosch TDA 2650 GB Quickfill, the highest rated iron of 2012.</p>\n    <p> </p>\n    <p>Preston’s coroner had estimated the time of death at about 2:15am.&nbsp; The murder weapon had not been found yet, and the trail of blood leading out of Shawn’s hotel suite had run cold quickly. No witnesses had come forward.&nbsp; The extreme ironing community was notoriously tight-knit and likely to protect their own.&nbsp; They had done so in the past.</p>\n    <p> </p>\n    <p>“Detective Clay, they’re ready.”&nbsp; A police officer on scene had separated the suspects, and she handed me a list of names.&nbsp; I squared my shoulders and got started with the interview process.</p>\n    <p> </p>\n    <p><strong>Anna Krueger</strong></p>\n    <p> </p>\n    <p>Anna Krueger, the hotel manager, was already in Shawn’s suite pacing around and surveying the extensive damage.&nbsp; Pieces of drywall and broken glass littered the carpet, and the tell-tale burn marks of overly hot irons defaced the furniture and carpet.</p>\n    <p> </p>\n    <p>I watched her until she stopped mid-pace near the end table next to the couch and knelt down.&nbsp; Anna stuck her arm in a hole in the wall and pulled out a Panasonic NI-A66-K Automatic iron.</p>\n    <p> </p>\n    <p>“I never would have allowed these Extreme Ironing United States assholes to have Ex-Ir Con here again if I weren’t so hard-up for money.&nbsp; At least they rented out the entire place.” Anna glared at the iron-shaped hole in the drywall.&nbsp; “They always ruin something.&nbsp; They leave burns and run up the electric bills plugging in all their stupid irons.”</p>\n    <p> </p>\n    <p>She raised her eyes to meet mine and brandished the iron.&nbsp; “But this time, Shawn went too far.”</p>\n    <p> </p>\n    <p>“When was the last time you saw him, Ms. Krueger?”</p>\n    <p> </p>\n    <p>“He came down last night around 11 asking for more towels.”&nbsp; She pointed at a pile of charred towels near the couch.&nbsp; “I can see why he asked.”&nbsp; Anna held out the Panasonic iron, her hand shaking.&nbsp; “The temperature gauge is on the highest setting.&nbsp; He was burning things on purpose.&nbsp; If he were still alive, I’d sue him into oblivion!”</p>\n    <p> </p>\n    <p>“Ms. Krueger, do-”</p>\n    <p> </p>\n    <p>“Check with that ironing board vendor, Detective.&nbsp; I had to chase him out of the storage room around 2:30 this morning.&nbsp; Mighty suspicious, if you ask me.”</p>\n    <p> </p>\n    <p><strong>Erroll Fleming</strong></p>\n    <p> </p>\n    <p>Erroll Fleming, the owner of the Cleveland Ironing Board Company, leaned against the wall in his room. “That damned Shawn,” he growled, German accent thick on his tongue. “He ruined me.&nbsp; He posted negative reviews of my new ironing board design and used his extreme ironing championship fame and influence to boost them.”</p>\n    <p> </p>\n    <p>“Go on.”</p>\n    <p> </p>\n    <p>“The Cleveland Steamer.&nbsp; It was a board made specifically for steam irons.&nbsp; Shawn is - was - a proponent of steam irons, but he said my board had a shitty design.&nbsp; His was the number one review on Amazon!&nbsp; Everyone saw it.&nbsp; My profits tanked.&nbsp; No one bought!&nbsp; I am glad he is gone.”</p>\n    <p> </p>\n    <p>“I’m sure his negative reviews were the only reason no one bought the board.”</p>\n    <p> </p>\n    <p>Erroll’s eyes widened, and he straightened his back.&nbsp; “I am not happy he is dead.&nbsp; That is a terrible thing to say.&nbsp; I am innocent, of course.”</p>\n    <p> </p>\n    <p>“Mr. Fleming, can you tell me what you were doing in the storage closet last night?”</p>\n    <p> </p>\n    <p>Color rose to his cheeks.&nbsp; “I cannot say.&nbsp; It would ruin me!”</p>\n    <p> </p>\n    <p>“I thought your business was already ruined by Mr. Morrison.”</p>\n    <p> </p>\n    <p>“Yes, my beautiful Cleveland Steamer, but I had other boards in development.”</p>\n    <p> </p>\n    <p>“What does this have to do with your excursion?”</p>\n    <p> </p>\n    <p>Erroll sucked in a breath and held it until I thought he might faint.&nbsp; Finally, he breathed out and answered.&nbsp; “I was looking at the hotel’s ironing boards.”</p>\n    <p> </p>\n    <p>I frowned.</p>\n    <p> </p>\n    <p>“I couldn’t come up with any good ideas!” he wailed.&nbsp; “I was looking for inspiration.&nbsp; You can’t tell anyone that I’m an ironing board design fraud!”</p>\n    <p> </p>\n    <p>Erroll slumped back against the wall.&nbsp; “Gottverdammt,” he whispered.</p>\n    <p> </p>\n    <p>“Thank you for your time, Mr. Fleming.&nbsp; Please-”</p>\n    <p> </p>\n    <p>“Wait!&nbsp; You should talk to the tall man with curly hair.&nbsp; I saw him sneaking out of Shawn’s room last night after 2.”</p>\n    <p> </p>\n    <p><strong>Thomas Prince</strong></p>\n    <p> </p>\n    <p>“The tall man with curly hair” was Thomas Prince, a long-time advocate for the use of steam irons over dry irons in the Extreme Ironing competition world.&nbsp; Thomas was a prolific donor to Kickstarter campaigns for new steam iron technology, and he wielded a Rowenta DW5270U1 Focus Excel steam iron during competitions.</p>\n    <p> </p>\n    <p>He looked up from the hotel bed when I walked in, eyes red and puffy.&nbsp; “Detective?”</p>\n    <p> </p>\n    <p>“I hear you were out late.”</p>\n    <p> </p>\n    <p>“Yeah, I went to see Shawn.”</p>\n    <p> </p>\n    <p>“Any particular reason?”</p>\n    <p> </p>\n    <p>“We’re friends.”&nbsp; Thomas frowned and corrected himself.&nbsp; “Were friends.”</p>\n    <p> </p>\n    <p>“Mr. Prince, your visit makes you the last person to see Shawn alive.”</p>\n    <p> </p>\n    <p>“That doesn’t mean anything.&nbsp; Have you talked to Noah yet?&nbsp; He was going to drop some major news on us tonight, and Shawn got wind of it yesterday.&nbsp; He was so upset.”</p>\n    <p> </p>\n    <p>“What news?”</p>\n    <p> </p>\n    <p>“Shawn wanted to take over EIUS.&nbsp; He thought Noah was doing a shit job, and he’s never been shy about voicing his opinion.&nbsp; Noah threatened him, so Shawn took a swing.&nbsp; Caught him right in the jaw.&nbsp; Good thing he has a weak punch.”</p>\n    <p> </p>\n    <p>“Go on.”</p>\n    <p> </p>\n    <p>Thomas leaned back.&nbsp; “Not much else to say.&nbsp; I went to Shawn’s room to talk him down after that.&nbsp; He was pretty shaken up and talking about leaving EIUS completely.&nbsp; Noah had really gotten him riled up.”</p>\n    <p> </p>\n    <p>“I appreciate the information.&nbsp; In the meantime, I would like you to stay right here.”</p>\n    <p> </p>\n    <p>Thomas shot me an annoyed look.&nbsp; “Am I still a suspect?”</p>\n    <p> </p>\n    <p>“You were seen leaving Shawn’s room last night, and his body was found this morning.&nbsp; I’d say you’re the primary suspect.</p>\n    <p> </p>\n    <p>I called for additional officers to watch Thomas’ room while one officer remained inside.</p>\n    <p> </p>\n    <p><strong>Noah Bowers</strong></p>\n    <p> </p>\n    <p>I approached the sullen President of Extreme Ironing United States, Noah Bowers, in the hotel’s business center.&nbsp; He looked up from his seat at a small conference table.&nbsp; Before I could say anything, Noah spoke.</p>\n    <p> </p>\n    <p>“You think I did it, don’t you?”</p>\n    <p> </p>\n    <p>“I didn’t say that.”</p>\n    <p> </p>\n    <p>“But you know I threatened him, right?&nbsp; Well, he threatened me first.&nbsp; I didn’t want him to, like, think I was intimidated.”&nbsp; Noah stood up and spun one of the chairs.&nbsp; “Look, bro, Shawn was a dick, okay?&nbsp; That’s no secret. &nbsp; So he wanted to oust me and, like, take over as President of the EIUS.&nbsp; That doesn’t mean I killed him.”</p>\n    <p> </p>\n    <p>I said nothing.</p>\n    <p> </p>\n    <p>Noah grunted and crossed his arms.&nbsp; “If you really want to know who did it, you should talk to his fiancé Marin, bro.&nbsp; She was gonna, like, poison him or something.”</p>\n    <p> </p>\n    <p><strong>Marin Knox</strong></p>\n    <p> </p>\n    <p>I visited Marin in her hotel room.&nbsp; She was sitting calmly on the hotel bed watching a reality show, and she didn’t bother to look up as I entered the room.</p>\n    <p> </p>\n    <p>“I understand you found Shawn this morning, Ms. Knox.”</p>\n    <p> </p>\n    <p>“Sure did.&nbsp; I went in to make sure he was up in time for the convention.&nbsp; He liked to sleep in.”</p>\n    <p> </p>\n    <p>“You had access to his room?”</p>\n    <p> </p>\n    <p>She stared at me.&nbsp; “Duh.&nbsp; We were engaged.”</p>\n    <p> </p>\n    <p>“You don’t seem upset that your fiancé was murdered.”</p>\n    <p> </p>\n    <p>Marin shrugged.&nbsp; “I’m not.&nbsp; He was an abusive, cheating piece of shit, and I was going to end things tonight.&nbsp; But now I have to thank someone for saving me the trouble.”</p>\n    <p> </p>\n    <p>“I understand you were planning to poison Shawn.”</p>\n    <p> </p>\n    <p>Marin cocked a thin brow.&nbsp; “Why would I poison him when I could leave him?&nbsp; That’s why I got my own room in the first place.&nbsp; I was thinking of putting eye drops in his food so he’d shit his guts out.&nbsp; So yeah, maybe that’s technically poisoning him, but he wouldn’t have died or anything.”</p>\n    <p> </p>\n    <p>“It’s still an actionable offense, Ms. Knox.”</p>\n    <p> </p>\n    <p>“Whatever.&nbsp; Like I said, I didn’t do it.”&nbsp; She paused in thought.&nbsp; “You should talk to Eddie.&nbsp; I saw him arguing with Shawn yesterday.&nbsp; It looked pretty heated, but I didn’t stick around to listen.&nbsp; Probably something to do with steam versus dry irons again.&nbsp; Eddie’s crazy for dry irons.”</p>\n    <p> </p>\n    <p><strong>Eddie Wu</strong></p>\n    <p> </p>\n    <p>Eddie Wu was doodling on hotel stationery, but he put the pen down as I walked into his room.&nbsp;</p>\n    <p> </p>\n    <p>“I understand you and Mr. Morrison exchanged words yesterday.”</p>\n    <p> </p>\n    <p>“We have the same argument every time we see each other,” Eddie said, sitting up a little straighter.&nbsp; “He’s always going on about steam iron superiority, but he fails to see the beauty and simplicity of a classic dry iron.”</p>\n    <p> </p>\n    <p>“When did you last see Mr. Morrison?”</p>\n    <p> </p>\n    <p>Eddie continued as though I hadn’t spoken.&nbsp; “Using a dry iron is an art form.”&nbsp; He walked across the room towards an ornate case.&nbsp; “Let me show you.”</p>\n    <p> </p>\n    <p>“That’s okay, I-”</p>\n    <p> </p>\n    <p>“My iron!” he cried out in panic.&nbsp; Eddie showed me the empty case.&nbsp; “Where is it?”</p>\n    <p> </p>\n    <p>“How-”</p>\n    <p> </p>\n    <p>Eddie sank to his knees, tears spilling from his eyes.&nbsp; “My glorious iron.&nbsp; I can’t believe it’s gone.”</p>\n    <p> </p>\n    <p>“Mr. Wu, I need-”</p>\n    <p> </p>\n    <p>“I don’t care about your needs, Detective.&nbsp; What about mine?&nbsp; My iron is missing!&nbsp; The perfect soleplate, unblemished by steam holes, polished to a high shine.&nbsp; Did you know I had a custom handle built to fit my hand perfectly?”</p>\n    <p> </p>\n    <p>My heart skipped a beat, and an image of my wife thrust itself into my head.&nbsp; The iron mark on her face wasn’t perfectly smooth.&nbsp; There were spots - steam holes - but Shawn’s mark had no holes.&nbsp; He was killed with a dry iron.</p>\n    <p> </p>\n    <p>“Mr. Wu,” I said, struggling to keep my voice even, “who else here is a dry iron aficionado?”</p>\n    <p> </p>\n    <p>“You wouldn’t believe me if I told you.”</p>\n    <p> </p>\n    <p>“Try me.”</p>\n    <p> </p>\n    <p>Eddie grinned like the Cheshire cat.&nbsp; “Shawn Morrison.”</p>\n    <p> </p>\n    <p>“Did anyone else know?”</p>\n    <p> </p>\n    <p>Eddie shrugged.&nbsp; “This is a small world, Detective.&nbsp; It’s hard to hide something so scandalous.”&nbsp; His grin faded.&nbsp; “You should talk to Thomas.”</p>\n    <p> </p>\n    <p><strong>Thomas Prince</strong></p>\n    <p> </p>\n    <p>Thomas jerked up in surprise as I walked in the door.&nbsp; He set aside the iron he was cradling and wiped a tear from his eye.</p>\n    <p> </p>\n    <p>“Mr. Prince, how well do you know the others at this convention?”</p>\n    <p> </p>\n    <p>“Well, me and Shawn go way back, of course.&nbsp; Eddie’s been around for a while.&nbsp; We don’t agree on irons, but he’s a nice guy.&nbsp; Marin came into the mix a couple years ago.&nbsp; Noah’s been the president of EIUS for a long time, but he mostly keeps to himself.&nbsp; I don’t know him that well.”</p>\n    <p> </p>\n    <p>“Do you know if anyone might have a motive to harm Mr. Morrison?”</p>\n    <p> </p>\n    <p>“Marin and Shawn have been together for a long time, but that’s been falling apart.”&nbsp; Thomas made a face.&nbsp; “She’s a real piece of work.&nbsp; I wouldn’t trust her with my iron under any circumstances.&nbsp; But I don’t really know the others well enough to say.”</p>\n    <p> </p>\n    <p>I took a deep breath.&nbsp; “Did you know that Shawn was secretly into dry irons?”</p>\n    <p> </p>\n    <p>Thomas winced.&nbsp; “I went to visit him after he argued with Noah.&nbsp; He was really stressed out.&nbsp; I don’t think he meant to tell me, but he slipped up.&nbsp; He told me about his preference for dry irons.”</p>\n    <p> </p>\n    <p>“Go on.”</p>\n    <p> </p>\n    <p>“I was shocked, you know?&nbsp; We had spent years talking about the merits of steam irons over dry.”&nbsp; Thomas threw his hands in the air.&nbsp; “I mean, you can use a steam iron as a dry iron!&nbsp; But he just kept talking about how cool Eddie’s iron was.”</p>\n    <p> </p>\n    <p>Thomas stood and walked to the window.&nbsp; “I asked him if I could have his championship winning steam iron.”</p>\n    <p> </p>\n    <p>“And?”</p>\n    <p> </p>\n    <p>“I know it was kind of selfish to even ask, but it’s a steam iron.”&nbsp; He faced me, his mouth hard.&nbsp; “If he was so into dry irons, there’s no reason he needed to keep that one.”</p>\n    <p> </p>\n    <p>I knew the answer already.&nbsp; “He said no.”</p>\n    <p> </p>\n    <p>Thomas hung his head.&nbsp; “Yeah.”</p>\n    <p> </p>\n    <p>That’s when I noticed it.&nbsp; A plug barely poked out from under the hotel’s dresser.&nbsp; Thomas noted my pause and followed my gaze.&nbsp; We lunged at the same time, but I reached the dresser first, knelt, and yanked the cord.</p>\n    <p> </p>\n    <p>And there it was: the Oster Heavyweight GCSTBV4119 Classic, stained with what was surely the victim’s blood.&nbsp; Eddie Wu’s missing iron.</p>\n    <p> </p>\n    <p>I expected to fight my way out of the situation, but Thomas sat down heavily and exhaled.</p>\n    <p> </p>\n    <p>“I didn’t mean to kill him.”</p>\n    <p> </p>\n    <p>I backed away from Thomas to the room door.</p>\n    <p> </p>\n    <p>“Shawn had Eddie’s iron in his room.&nbsp; He was messing with it.&nbsp; I think he was trying to break it so Eddie wouldn’t win in today’s competition.”&nbsp; Thomas groaned.&nbsp; “And that was bad enough.&nbsp; If the sponsors found out, we’d lose all those investments.&nbsp; But when he refused to give me his steam iron, I just snapped.”</p>\n    <p> </p>\n    <p>I stuck my head out the door and motioned for the nearest officer to assist me.</p>\n    <p> </p>\n    <p>“Before I could even think about what I was doing, Shawn was on the floor, and I was holding Eddie’s iron.&nbsp; I brought it back here to hide it, but you see how much good that did me.”&nbsp; Thomas looked down at his hands.&nbsp; “I’ll never iron again.”</p>\n    <p> </p>\n    <p>The officer casually entered the room.</p>\n    <p> </p>\n    <p>“I won’t resist,” he said, looking straight at me.&nbsp; “I messed up.”</p>\n    <p> </p>\n    <p>“Mr. Prince, please remain still,” the officer said gently as she bent down and handcuffed Thomas’ hands behind his back.</p>\n    <p> </p>\n    <p>The officer led Thomas away, but the satisfaction of solving the case rang hollow in my heart.&nbsp; I returned to other suspects to tell them they were free to go.</p>\n    <p> </p>\n    <p>When I got to Marin's room, she simply nodded and started packing her things.&nbsp; But there was something I had to know.</p>\n    <p> </p>\n    <p>“Did you know your boyfriend was a dry iron promoter?”</p>\n    <p> </p>\n    <p>Marin’s eyes widened.&nbsp; “Shawn’s been advocating the benefits of steam irons both in competition and in the home for years.”</p>\n    <p> </p>\n    <p>The slight tremble in her voice gave her away.&nbsp; She was hiding something.</p>\n    <p> </p>\n    <p>“What aren’t you telling me, Ms. Knox?”</p>\n    <p> </p>\n    <p>She stared at the floor and bit her lip.&nbsp; “Look, he’d always use a steam iron for shows and competitions because that’s what people expected.&nbsp; He had a sponsor to please, a wealthy one.&nbsp; But behind closed doors, we-” Marin took a deep, shuddering breath.&nbsp; “Behind closed doors, we used a dry iron.”</p>\n    <p> </p>\n    <p>She buried her face in her hands.&nbsp; “Oh god, you can’t tell anyone!&nbsp; His reputation would be destroyed.&nbsp; The sponsor would pull all their funding out of the projects he and Thomas were working on.”</p>\n    <p> </p>\n    <p>“Like what?”</p>\n    <p> </p>\n    <p>“They had an idea to improve this older model steam iron, right?&nbsp; To make it more efficient and easier to clean.&nbsp; The steam holes on that model were tough to clean, but it was otherwise a great iron.&nbsp; I would even use it sometimes when he wasn’t at home.&nbsp; I liked it better than his dry iron.”&nbsp; She laughed sadly.&nbsp; “He would have been so mad.”</p>\n    <p> </p>\n    <p>Marin stood up and started to pace.&nbsp; “Anyway, he never got a new steam iron, so he always used the same one.&nbsp; His championship iron.&nbsp; It was iconic.&nbsp; Blue and white.&nbsp; Have you ever seen it?”</p>\n    <p> </p>\n    <p>Something in her voice made me uneasy.</p>\n    <p> </p>\n    <p>“Let me show you,” Marin continued.&nbsp; “It’s beautiful, Xavier.”</p>\n    <p> </p>\n    <p>“How... how do you know my name?”</p>\n    <p> </p>\n    <p>She opened a decorative case near the foot of the hotel bed and pulled out an iron.</p>\n    <p> </p>\n    <p>My blood ran cold.</p>\n    <p> </p>\n    <p>It was a Bosch TDA 2650 GB Quickfill.</p>\n    <p> </p>\n    <p>Marin smirked at my expression.&nbsp; “You recognize it, don’t you?&nbsp; Or rather, you recognize the shape of the soleplate.&nbsp; It was the same one that killed your wife eight years ago.”&nbsp; She stepped closer, her grin widening.&nbsp; “He did it, you know?&nbsp; Shawn killed her.&nbsp; She found out his secret obsession with dry irons, and he couldn’t allow her to talk.”</p>\n    <p> </p>\n    <p>I inched my hand towards my concealed pistol.&nbsp; “Put the Bosch down, Marin.&nbsp; You don’t have to do this.”</p>\n    <p> </p>\n    <p>Marin raised the iron, her pupils dilated with madness.&nbsp; “But I’ve always wanted to know what it felt like.&nbsp; What it could feel like to kill someone.”</p>\n    <p> </p>\n    <p>She swung the iron towards my head, barely missing.&nbsp; I called for backup and pulled out my pistol to defend myself.&nbsp; “I don’t want to shoot you.”</p>\n    <p> </p>\n    <p>Two police officers swept into the room before I had to take any further actions.&nbsp; Marin was quickly disarmed and handcuffed.&nbsp; She glared at me as the officers pulled her from the room,&nbsp; but she said nothing further.</p>\n    <p> </p>\n    <p>My heart ached with memories of my wife.&nbsp; Whether he knew it or not, Thomas had given her a little bit of justice, but that didn’t excuse his actions.&nbsp; He would be behind bars for a long time.&nbsp; Marin would serve time for being an accessory to murder for covering up Shawn’s crimes.&nbsp; I would have preferred to see Shawn stand trial, to look into his face with satisfaction as the bailiffs hauled him away.</p>\n    <p> </p>\n    <p>I would have to content myself knowing the truth of my wife’s murder had finally been ironed out.</p>\n</article>"
      },
      {
        "id": 3,
        "title": "Fall Of the Stars",
        "story": "<article><p>The heavens glittered with stars as the man silently drove over dirt and gravel, the thousand twinkling eyes mocking his desperation.&nbsp;</p><p>Muttering a curse under his breath, he slowed down at the rusty security gate at the entrance of the abandoned mines. To an ordinary person it would be a half-broken gate with just a couple of night guards sleeping their shift away. But then again, the average person wouldn’t notice that the old equipment was strewn about almost too cleanly, or that the uniformed guards lacked an identity or a logo.</p>\n    <p> </p>\n    <p>Or how a cold eye glinted from under the angled cap, a sleek gun pointed at any approaching vehicle. Private security.</p>\n    <p><em>Good,</em>&nbsp;he smiled. He’d expected nothing less.</p>\n    <p> </p>\n    <p>He rolled down a window and casually brought up his right hand to scratch his stubble, flashing them the tattoo on his arm. One of guards came over to inspect it, shining a flashlight right in his face. Satisfied, he nodded to the other one, and the gate opened.</p>\n    <p> </p>\n    <p>The newcomer growled at them as he drove past. The guards didn’t blink.</p>\n    <p> </p>\n    <p>He took the car to the mouth of the mines and parked it aside a vintage piece, tossing the keys inside when he got out.&nbsp;</p>\n    <p><em>Won’t be getting out in this ride, that’s for sure.</em></p>\n    <p>He took one last look at the night sky. The stars still winked at him.&nbsp;<em>I’ll show you, you damned twinklers,</em>&nbsp;he thought.&nbsp;<em>And then you and your glowing arses can collectively burn the fuck out.</em></p>\n    <p> </p>\n    <p>He walked in and took the narrow elevator down, fixing a crick in his neck to look at the small black camera from the corner of his eye. The caged door opened into a tunnel entrance sealed long-ago. Dim light and vulgar music blared from within.&nbsp;</p>\n    <p> </p>\n    <p> </p>\n    <p>The tunnel widened into a narrow hall within, a despicable den of sin. Sellers had set up their wooden stalls on either side, sporting wares of all kinds and catering to the needs of anyone bold or foolish enough to venture within.&nbsp;</p>\n    <p> </p>\n    <p>A place fit for the lowest of low-life scum, the kind who’d kill their own mothers for the right price. Everything in the hall was as good as Eden’s forbidden fruit on Earth, attracting a number of fools who’d end up unconscious in dirty alleys, pickpocketed at best, missing an organ or an appendage – if not sporting a slit throat, at worst.&nbsp;</p>\n    <p> </p>\n    <p>The market and its dealers had been thriving in the sealed mine for almost a decade now, and he had no doubt that even the poorest of these merchants could have half the law enforcement in their pockets.&nbsp;</p>\n    <p> </p>\n    <p>He grunted.&nbsp;<em>Hell, half the buying and betting crowd out here was law enforcement</em>. Drugs, flesh, poison, weapons– they themselves would know where best to find any product being sold in the dark hall. The man sighed and jammed a hand in his pocket, pulling out a pack of gum. He looked it over with a frown and popped one in his mouth, tossing the rest in a makeshift stall with a wink at the seller.&nbsp;<em>Let him pour over hours wondering what’s so special about it</em>, he allowed the thought to bring him a dry chuckle.&nbsp;</p>\n    <p> </p>\n    <p>Visibly relaxed now, he cleared his thoughts and covered the tattoo on his arm, lest it be discovered by someone who carried one of its counterparts. He’d thought about this evening too much to spend it in a petty black-market fight.&nbsp;</p>\n    <p> </p>\n    <p>Ignoring the purrs of a woman offering him the finest opium and a merchant sporting priceless stolen jewels, he made his way to the guarded room on the other end, where once again a discreet flash of his ink admitted him within.</p>\n    <p> </p>\n    <p>A flash of white greeted him on the other side. White tiles decked the room, save for the ceiling, which held a long mirror across the length of it. Across the table from him sat a red-faced man in a puff of smoke, cigar in one hand and a wicked blade in the other, a host of monitors beside him. Eye of The Market. He leaned forward with his mouth split in a grin, rivulets of sweat running down his temple into his short-cropped white hair.</p>\n    <p> </p>\n    <p>“Welcome, my friend. Mr. Rahsut, I presume? I’m Gvadiskvi, we… spoke via our mutual contact, who sadly passed away today.” He took his visitor’s hand, shaking it and nodding. “Tragic, really, but you know how it is. I was hoping you’d stop by this week. Give us a chance to talk in person.”</p>\n    <p> </p>\n    <p>“Yes. A conversation has been long due.” The man called Rahsut replied, pulling his hand back. He remained standing.</p>\n    <p>“Now, my friend. We are friends, yes? He-he. I would offer you a cigar, but unfortunately, I do not yet know if you are a friend. Let’s save the cigar for later, then. A question for now. I heard from our friend Rihake you were taking an interest in the pits. You ask many questions, my friend, he-he. I must know, now, because I dislike having to answer so many questions, do you intend to partake in any way at all? Place a few bets, maybe indulge yourself in a match? Perhaps you’d like me to fix one for you, if only your first to get you a little start? He-he, say so, and we have a deal.”</p>\n    <p> </p>\n    <p>“I don’t want to place bets, Gvadiskvi.”</p>\n    <p>His host’s eyes narrowed, his smile faltering “Then you will understand, there are steps to be taken. We must be cautious about our little venture, he-he.”</p>\n    <p> </p>\n    <p>&nbsp;“You misunderstand,&nbsp;<em>friend</em>.” He spat with a smile of his own, “I wish to fight in the pits.”</p>\n    <p>The red-faced man barked a laugh, hurling his cigar across the room. “Well, then, my friend, he-he, we must drink to that!” he shouted “I knew I liked you the moment you walked in.” He poured out a strange green liquor in glass mugs kept behind his desk. “Come, Mr. Rahsut, we drink to victory. To living forever, and battering one’s enemies to death!”</p>\n    <p> </p>\n    <p>The man called Rahsut raked a hand through his dusty hair, clenching his fist at the drawn-out conversation “I do not drink before a fight. I will, however, take a whiff of your finest snow.”</p>\n    <p>“Aye, it is a cold night, Mr. Rahsut, and you are a bold one.” he sniggered “My new friend, a man of taste!”&nbsp;</p>\n    <p> </p>\n    <p>The man called Gvadiskvi obliged, immediately sending for his finest of the drug. He invited his guest to sit across him and talk. “Come then, tell me.” He grinned “What brings you here?”</p>\n    <p>Rahsut tilted his head, starting. “I t-”</p>\n    <p>“Huh-uh” he was cut off “Please, do not insult my intelligence. I’m curious,” the other man leaned forward “I truly am. Why would a man like you resort to this?”</p>\n    <p> </p>\n    <p>He stared across the table icily. “You don’t know me. Don’t pretend to.”</p>\n    <p>“But surely someone such as you would have noticed the shadows trailing you, yes?” A giggle. “They’ve been watching you. The way you walk, the way you talk… the much-concealed desperation in your eyes… he-he.”</p>\n    <p> </p>\n    <p>“Maybe I have a death wish.”</p>\n    <p>“Ah, but that’s not the half of it, my dear Mr. Rahsut, is it?” his watery eyes gleamed, sending a shiver of revulsion down the addressed man’s spine.</p>\n    <p>“Having a death wish doesn’t have to be personal.” He said quietly.</p>\n    <p>“Oh, but coming here always is.”&nbsp;</p>\n    <p> </p>\n    <p> </p>\n    <p>His drug came and he consumed it, courtesy of the House. He rolled his neck, grasping at his colliding thoughts and the clarity he now had. He pulled out the battered old pocket watch; A half hour still remained before he’d fight. The man called Rahsut suddenly realized that he was talking and stopped, visibly shaken. He found himself staring across at his half-witless host who beseeched him to continue.</p>\n    <p> </p>\n    <p>“You were at the bit where you had the epiphany after giving up your old ways, when the fighting was over. Go on, then.”&nbsp;</p>\n    <p>He considered for a moment, then shrugged.&nbsp;<em>No harm done. Screw it, it wouldn’t matter after tonight anyway.</em></p>\n    <p> </p>\n    <p>“When it struck me,” he spoke through the piece of gum still in his mouth “How much the stars and I are alike.&nbsp;</p>\n    <p>Gvadiskvi hummed in appreciation “How poetic for a man of your… bearing. But do tell, how so?”</p>\n    <p>“It’s silly, really, but also true.” he snorted a scoff, waving his hand airily. “When they die, it’s got to be a cosmic carnage, or no one knows cares, because otherwise no one would know when they die.”</p>\n    <p> </p>\n    <p>The other man spoke through a puff of smoke as he lit another cigar “Ah, much like battle veterans and mercenaries such as yourself, eh? He-he.”</p>\n    <p>“Yes, and the natural way is… too mundane.” He tasted the word on his tongue, and how morbid it felt. “So, I thought why not die in a carnage and make people care.”</p>\n    <p>“Care?” Gvadiskvi went silent for a long moment. “Do you truthfully think the people he-”</p>\n    <p>“Enough to place bets, anyway.” He retorted.</p>\n    <p> </p>\n    <p>The elder man undid a button on his shirt, rolling back his shoulders. “Fair enough. You want to bring business to me, who am I to refuse, my violent friend?”</p>\n    <p> </p>\n    <p>A bolt of lightning went up his spine, and Rahsut tilted his head. His host noticed it.</p>\n    <p>“Oh, come on. I’ve been running the pits for nine years now, how many of your kind do you think I’ve seen?” he huffed a laugh, thick smoke momentarily covering his face. “I lost the count from not caring, Mr. Rahsut, if I ever was honest, and you’re simply another face in that pile. Men like you, you only like violence. Do you know why?”</p>\n    <p> </p>\n    <p>He looked at him, very still.</p>\n    <p>“Because it’s the easiest thing to do.” He continued, twirling the knife in his hand. “So you go about your life, with violence as your creed, until suddenly one day you realize that you’re all alone. So, what do you do?&nbsp;</p>\n    <p>He said nothing as the eyes across his bore into his own with a cruel smile.</p>\n    <p>“You turn on yourself, becoming violent to life itself. Hating your existence, and desperate for the bittersweet mercy the&nbsp;<em>idea</em>&nbsp;of death offers.” Gvadiskvi looked into his eyes. “And so…</p>\n    <p> </p>\n    <p>“You turn to men like me. Like I said, Mr. Rahsut, I recognize people like you. I think you’ll find some kindred spirits in here this evening. Try to be merciful to them a little, he-he.” He finished with a twinkle in his eyes.</p>\n    <p> </p>\n    <p>Feeling uncomfortably vulnerable, he rode on a surge of blood and vaulted over the table in a blur, grabbing Gvadiskvi to whirl behind him, the knife now in his hand and held to his host. “If you claim to know my motivations so well, then tell me,&nbsp;<em>friend</em>,” he spat, “Why don’t I be a gentleman and grant you some mercy right now?”</p>\n    <p> </p>\n    <p>The man laughed softly, feeling his own blade digging into his throat. “I am trying to be polite, Mr. Rahsut, but if you move that knife one inch closer to me, I will rip your heart out. Besides, we both know that you’d rather put on an impressive display, if you are so adamant on dying.”</p>\n    <p> </p>\n    <p>Rahsut released him, taking a step back. “The pits are crowded tonight,” Gvadiskvi remarked with the eyes of a predator “Our old friend Rihake picked you a good night to fight, he-he…”</p>\n    <p> </p>\n    <p> </p>\n    <p> </p>\n    <p>The fighting pits had been emptied and a large area cleared for the closing event of the night. It was sparsely decorated, a handful of oil drums scattered to provide cover and a few low-hanging bulbs as the only source of light in the wide hall.</p>\n    <p> </p>\n    <p>The crowd was brimming with nervous energy, with people shoving each other for the best spot to view the last fight without falling inside. Rules of the arena were clear<em>;&nbsp;</em>A single step in and you were fair game.</p>\n    <p> </p>\n    <p>The audience silently parted as its supreme benefactor glided through. Aytanpar Gvadiskvi, the man who ran the pits, and every piece of low-life scum that haunted the mines. He raised his arm, holding a glass of exquisite liquor, and the world fell silent.</p>\n    <p> </p>\n    <p>“Greetings, Children of the Pits!” he boomed “I have a special night in store for you. The matches till now have offered but a slice of the excitement to come.” He looked at those who would fight now, spotting them in the audience.&nbsp;</p>\n    <p> </p>\n    <p>“No-life is better than half a life. Tonight, the six individuals gathered in the arena share more than blood-brothers do in a lifetime! They share this thought, and are willing to fight to the death to prove it. They are the superior people amongst us, for these men and women have looked into the eyes of desire and stared it down. Riches or luxury, a good, quiet life… that’s too much to ask of them. They live for the combat, and for the combat they willingly die! Most of them, anyway…” he trailed off.</p>\n    <p> </p>\n    <p>The crowd cheered. The man nodded and continued, “We are graced with our weapons master, Mr. Black, offering us the chance to witness his latest wares in action!”&nbsp;</p>\n    <p>The crowd went wild, shrieks and whoops filling the air as the said man joined Gvadiskvi, completely decked in black, only parts of his face not covered by his wide-brimmed hat or sunglasses visible as his lip burst in a cheery laugh. He waved. “Tonight, I bring to you,” he started in a deep voice as the crowd went silent “The only functioning prototypes of my latest gun, a tranquilizer coated with poison from deadly toads... and from my herb garden. Highly flammable, although one wouldn’t need fire for them to do their job. A slight graze could end a grizzly’s life, to say nothing of our own. Up for auction next week!”</p>\n    <p> </p>\n    <p>Murmurs streaked across the room as Gvadiskvi continued, “To make it more of a challenge, each of the fighters are equipped with a gun, good for two shots. No other weapons. Look closely, for if you blink, you may miss it... but mind your eyes, he-he.”</p>\n    <p> </p>\n    <p>At a signal, six figures stepped in the cleared area. A lithe figure prowled in, carefully eyeing her opponents. The woman had a vicious smile plastered on her face, tracing a finger up her leather-like body armor. “My new guns will go well with the gear.”</p>\n    <p>The other woman grunted and flicked her the finger. A thin man slicked a tongue over his teeth, filed into sharp fangs. “We’ll see about that, doll.” Two other men staggered inside, either drunk or badly beaten up recently.&nbsp;</p>\n    <p> </p>\n    <p>Rahsut was handed his gun as he weighed his options. Oil drums for cover. Low-hanging lightbulbs. A stale piece of gum in his mouth and a gun with two rounds of poison within. He nodded, taking a deep breath.&nbsp;<em>In mortality lies my victory. In victory, a worthy death. Till my last breath, the carnage will not stop.&nbsp;</em>He looked up in front of him. The carnage must stop. Tonight, then<em>. Death is life.&nbsp;</em></p>\n    <p> </p>\n    <p>A bell rang without warning and the crowd roared as slivers of crimson flew all around, spraying up a shower of blood where they struck. He moved in a flash, ducking past a couple of darts and backhanding a lightbulb. Those nearest to him flinched, momentarily blinded.&nbsp;</p>\n    <p>Those two died first.</p>\n    <p> </p>\n    <p>He shimmied up behind the loudmouthed girl with the protective gear, swiftly shooting at the unbalanced man across the room. He was dead before he fell, the dart buried in his eye. Grabbing her by the hair, he smashed her nose on the oil drum and she cried out, instinctively raising a hand to her face. He snaked a hand into the side of her neck and snapped, snatching the gun out of her hands even as her body fell.&nbsp;</p>\n    <p> </p>\n    <p>He ducked as a barrage of darts flew past him. Pressing his back against a drum, Rahsut peeked to find the other drunk-or-injured man already dead while the man with the razor-sharp teeth wrestled with the bulky woman, their guns tossed a few feet away.</p>\n    <p> </p>\n    <p><em>Huh. So much for that momentary truce.</em></p>\n    <p>He spied the lightbulb near him, still swinging. He grabbed it with one hand, pulling out the chewing gum with the other and sticking it on the bulb, recoiling when the hot glass burned his finger.&nbsp;</p>\n    <p><em>At least this will go quicker than I anticipated</em>, he thought as the glowing bulb twinkled like the stars outside.&nbsp;<em>Damned twinkler.</em></p>\n    <p> </p>\n    <p>He moved quickly, moving behind another oil drum as he fired twice at the one directly beneath the bulb, then tossed the dead girl’s now empty gun at it for good measure. A thin spray or oil spurted from it, steadily growing into a tiny fountain leaking oil that quickly spread across the floor.&nbsp;</p>\n    <p> </p>\n    <p>This caught the attention of the woman, who had finished crushing the throat of the thin man and pummeling him to death with her fists. She grinned, going for the two guns at her feet even as he leaped, and the world froze.</p>\n    <p> </p>\n    <p>In that moment, Rahsut saw everything. The horror on Gvadiskvi’s face, the victory on the woman’s, the final moments of the mine as he shot at the lightbulb which burst apart, flames engulfing the oil an-</p>\n    <p><em>Boom.</em></p>\n    <p> </p>\n    <p> </p>\n    <p>The next day, all the papers talked about the mine blow-up. A gas explosion, they called it. The official report said that no one was around when it happened, no one got hurt. The clean-up crew moved quickly, doing multiple sweeps and gathering what they found before loading the bodies in a truck to be taken away and incinerated. Yet no one noticed a single hand twitching still, of the dead man who would still live, outliving his own carnage. No one noticed the mouth speak obscenities in broken whispers, cursing at himself, at the stars, and at life itself.</p>\n\n</article>"
      }
    ]
  },
  {
    "id": 3,
    "category": "Drama",
    "image": "assets/images/drama.jpeg",
    "stories": [
      {
        "id": 1,
        "title": "The Eyes In The Forest",
        "story": "<article><p>The forest was bright and warm, the sunlight dappled across the leaf-covered ground in a way that evoked images of autumn holiday brochures and children laughing. There was a slight breeze rustling the upper branches, but down at ground level all it did was bring the warmth of the sun in from out in the meadows all around. For everyone not working, it was a weekend to head out and make the most of the last of summer, before the cold settled in.</p>\n    <p> </p>\n    <p>It was, I thought, a terrible place for a murder scene.</p>\n    <p> </p>\n    <p>“All right Andrews?” my boss asked as he came over. Despite the fair weather he was still clutching a take-out cup of coffee like a lifeline, and I could smell the alcohol from whatever he’d been doing last night.</p>\n    <p> </p>\n    <p>“All right, sir. I didn’t think you were on duty today?” Judging by the state of Detective Matthews, neither had he. However reckless he was on his night’s off, Matthews was a consummate professional out in the field, when the public could see him.</p>\n    <p> </p>\n    <p>“Huh, tell me about it. But, four bodies in three months. No one gets their Saturdays when that happens.”</p>\n    <p> </p>\n    <p>Some of us didn’t have many Saturdays anyway, but I only gave him a tight smile in response. It wasn’t right to bitch about hours and shift patterns when there was a dead body in the vicinity.</p>\n    <p> </p>\n    <p>Another car pulled up into the cordoned off area and Matthews turned to watch it. It wasn’t a vehicle I recognised, but I wouldn’t have considered myself an expert on the department’s cars. Besides, four bodies in three months. This was when the top brass got called in, and all the specialists scraped up from wherever they usually lurked.</p>\n    <p> </p>\n    <p>Matthews was having the same thought. “More god-damn people sticking their noses in, telling me what to do…” He walked back over to the ‘car park’ still muttering, leaving me to my solo guard duty. The investigators would go over the area first, then maybe I’d get called in to help sweep the area. Until then my contribution to catching a murderer was to stand still and keep people away. Of course, to get to me they’d have already had to get through two other police cordons. I was nothing more than window dressing at this stage, but the more serious the crime, the more window dressing the bosses wanted. Couldn’t let the press take a photo of empty space now, could we?</p>\n    <p> </p>\n    <p>Whoever had just turned up seemed to causing something of a stir with the other detectives. They all had more sense than to start shouting, but I recognised the way Matthews had started pacing. A few words drifted across the forest to me, though I didn’t get much other than tone. No one was happy about the new person turning up, and I wondered what sort of specialist would cause such a stink.</p>\n    <p> </p>\n    <p>Maybe it’s our own Sherlock Holmes, I thought to myself with a snort. It would make the shift more interesting at least, but there was no way that Sherlock Holmes would work with a modern policing system. All those deductions and assumptions? The evidence courts would be laughing themselves to death.</p>\n    <p> </p>\n    <p>The new arrival was coming my way. I wiped the smirk from my face and stood up a little straighter, staring dead ahead as I watched them out the corner of my eye. Smart suit, skinny glasses, slightly crocked tie, and far younger than I’d expected for a specialist. At a guess I’d put the man at a few years older than me, early thirties or so, although he could just have had one of those faces that ages well. His height didn’t help, and though the ground was uneven he was about eye level with me when he stopped.</p>\n    <p> </p>\n    <p>“Officer Andrews?” he asked, scanning me up and down. I’d braced for this moment – who doesn’t love a woman in uniform? – but there was nothing to his look. It was more like he was trying to read my name on my legs, rather than checking out any curve they may or may not have had.</p>\n    <p> </p>\n    <p>“Yes, sir.” Even though he was nameless, anyone out of uniform at a crime scene was pretty much guaranteed to be my superior. Better safe than sorry.</p>\n    <p> </p>\n    <p>“Can you take me down to the crime scene, please?”</p>\n    <p> </p>\n    <p>“One moment, sir.” I’d barely tapped the call button on my radio before Matthews started waving his arm at me and giving the thumbs up. I tried to nod back, though he didn’t watch long enough to see. “Right this way, sir.”</p>\n    <p> </p>\n    <p>I led the way through the trees to where the body had been found, all the while fighting down the urge to kick the leaves as I went. Precise placement wasn’t worth preserving when the leaves were so light and likely to move naturally, but it was hardly very professional. We came round one particularly large tree – meant to keep the victim out of sight, we figured – and there she was. No name, no purse, no shoes, clothing torn…</p>\n    <p> </p>\n    <p>Despite the warm air I shivered. There was no getting used to this bit.</p>\n    <p> </p>\n    <p>“Here, sir,” I said. It was obvious, but it didn’t feel right to just wave and go ‘ta-da’. Poor woman needed some respect in death, even if she didn’t get any in life.</p>\n    <p> </p>\n    <p>“Thank you, um, Andrews. You can go back to your post now.”</p>\n    <p> </p>\n    <p>“Are you sure… sir?” Solo investigation, seriously? And I hadn’t even gotten the man’s name, let alone his rank or speciality. But Matthews had waved me on. If this went wrong I could pin the blame on him, right? No, that was childish.</p>\n    <p> </p>\n    <p>“I’m sure. Thank you.” As he dismissed me he knelt down by the body and started looking at it, leaving me to walk away.</p>\n    <p> </p>\n    <p>I turned back half a dozen times, but he didn’t seem to be doing anything. Just staring. Waiting, perhaps. But then what for, me to leave? My stomach tied itself in knots and I looked at the dead woman’s face. I didn’t like leaving her here alone with him.</p>\n    <p> </p>\n    <p>Rank left me with no option though. I dragged my heavy feet back to where I’d been standing, and was grateful to see that Matthews had wandered closer again.</p>\n    <p> </p>\n    <p>“Sir?” I said as I came up behind him.</p>\n    <p> </p>\n    <p>“What’s up?” he asked. Despite the coffee cup hanging empty in his fingers he looked rougher than he had earlier. Whoever the stranger with the body was, he sure could rile people up.</p>\n    <p> </p>\n    <p>“Am I good to leave him alone, sir? Only protocol and all…”</p>\n    <p> </p>\n    <p>Matthews snorted. “Ha, protocol. Some fancy arse from god-knows-where rocks up and suddenly we’re ignoring it. Yeah yeah, it’s fine, Andrews. He’s got special dispensation.”</p>\n    <p> </p>\n    <p>Curiosity got the better of me. “How come?”</p>\n    <p> </p>\n    <p>“Because of his impeccable completion rate. Solved more crimes than half of our department by all accounts, so the sun shines from him and we all have to bend over and worship. Damn it, if I knew we’d be standing around with our thumbs up our arses I’d have gone and gotten another coffee.”</p>\n    <p> </p>\n    <p>I bit back all my opinions on what that would do for the twitch under his eye and watched as he walked away again. Curiosity was still burning inside me. ‘Impeccable completion rate’? What did that even mean? And if he worked alone, did that mean he had some secret technique for solving crimes?</p>\n    <p> </p>\n    <p>I headed back to my post, but when I got there I checked over my shoulder. No one was watching, not that they had any reason to. All the detectives were huddled together, all complaining judging by the way they folded their arms or put their hands on their hips. They really were quite a melodramatic lot. The other uniforms about were scanning the area, sorting paperwork, checking maps, milling about, trying to look useful. There was no telling when a camera could appear.</p>\n    <p> </p>\n    <p>I slipped past my spot and re-traced my steps back to the body. There couldn’t be some secret technique for solving crimes, so what exactly was that guy doing? I had to know, and I had to know that it wasn’t anything dodgy. Even with clearance from the boss, I’d brought the man out here and I’d left him here. He was my responsibility.</p>\n    <p> </p>\n    <p>Between the crispy leaves and my full uniform it was hard to sneak, but I did the best I could until I got to a nearby tree. From there I could lean round and watch the guy work. It took me a few moments and lots of blinking before I registered what I was seeing.</p>\n    <p> </p>\n    <p>The man was crouched on the ground where I’d left him, but he wasn’t looking at the woman. He was focused on the pair of squirrels sat across from him, on the other side of the corpse. Too add insult to injury, he was talking to them.</p>\n    <p> </p>\n    <p>“So it wasn’t an attack here? This was just a body dump?”</p>\n    <p> </p>\n    <p>My shoulders slumped. A great detective, wonderful record, and his secret technique was explaining things to animals? My brother would talk out programming problems to his dog, but this was just ridiculous. At least no one else saw my brother doing that, and at least he wasn’t doing it for a murder enquiry.</p>\n    <p> </p>\n    <p>“Yeah. The man knew her, was crying the whole time.”</p>\n    <p> </p>\n    <p>I froze at the other voice. There was no way…</p>\n    <p> </p>\n    <p>“Did he say anything?” the detective asked.</p>\n    <p> </p>\n    <p>“Yeah,” the squirrel – <em>the squirrel!</em> – replied. “Kept apologising, saying it was an accident. ‘I’m sorry, I’m sorry’, that sort of thing.”</p>\n    <p> </p>\n    <p>“And then what?”</p>\n    <p> </p>\n    <p>“He took her shoes,” the other <em>god damn squirrel</em> said. “Then he ripped her shirt, rumpled her clothes and all. She was properly dressed before she got here. He did all that here.”</p>\n    <p> </p>\n    <p>“Anything else?”</p>\n    <p> </p>\n    <p>“Don’t think so. That all you need?”</p>\n    <p> </p>\n    <p>“Yes, thank you. That’s most helpful.” The detective smiled and nodded at the squirrels before they turned and scurried away.</p>\n    <p> </p>\n    <p>My eyes were dry from the non-blinking staring and I ran a hand across my face. There was no way I just saw that. Had Matthews infected me with his hangover?</p>\n    <p> </p>\n    <p>The detective pulled out his notebook and jotted down some notes, before he looked up and round the clearing. I only just ducked back behind the tree in time.</p>\n    <p> </p>\n    <p>“Is there anyone else?” he said, just loud enough to carry, but not enough to reach back to where the other officers were. Heaven forbid they see him talking to the animals.</p>\n    <p> </p>\n    <p>On cue a mouse scurried up and perched on a branch sticking out of the leaves. “Yes,” it said.</p>\n    <p> </p>\n    <p>“And what did you see?”</p>\n    <p> </p>\n    <p>\"See, not much. But they smelt the same, her and the one who brought her.”</p>\n    <p> </p>\n    <p>“Exactly the same? Like, they lived together?”</p>\n    <p> </p>\n    <p>“Just so.”</p>\n    <p> </p>\n    <p>“Thank you. Anything else?”</p>\n    <p> </p>\n    <p>“No. Don’t see much I’m afraid.”</p>\n    <p> </p>\n    <p>“No worries. Thank you for your help anyway.”</p>\n    <p> </p>\n    <p>The mouse scurried away as the detective made more notes, and the last strand of my sanity snapped. I stormed out from my hiding space, oblivious to the fact I was marching through a crime scene.</p>\n    <p> </p>\n    <p>\"All right, what the hell is going on?” I said.</p>\n    <p> </p>\n    <p>The detective jumped to his feet, guilty as though he’d killed the woman, before a carefully schooled expression took over. “I am investigating this murder, officer. You should be back at your post–”</p>\n    <p> </p>\n    <p>“No! None of that! What the hell is happening? How the hell are the animals <em>talking?</em> And why the hell are you so calm about it?”</p>\n    <p> </p>\n    <p>“Miss, I can assure you–” He cut off mid-sentence and stared at me, as though I was the weird one in this scenario. “Hang on, talking?”</p>\n    <p> </p>\n    <p>“Don’t pull that crap with me, I saw you taking notes, you heard them–”</p>\n    <p> </p>\n    <p>“But so did you. You heard the animals talking?”</p>\n    <p> </p>\n    <p>“Yes! But how?”</p>\n    <p> </p>\n    <p>He ignored the anguish in my voice and just kept staring. I was halfway through weighing up whether to just punch him (assaulting a superior, and how would I explain why?) when he broke into huge grin. I hadn’t realised how morose he’d looked before, and I blushed at the sheer childlike joy on his face.</p>\n    <p> </p>\n    <p>“I’ve never met anyone else like this before,” he whispered. “Hey, prove it. Mouse! Come back.”</p>\n    <p> </p>\n    <p>The mouse scurried up again, though it shuffled away when it saw me. “Yes?”</p>\n    <p> </p>\n    <p>The detective spun to me and nodded. “Go on. Talk to it.”</p>\n    <p> </p>\n    <p>“Um,” I said. Would this count as playing along, or was I loosing my mind as well? For the first time in my life, I wanted nothing more than to be on guard duty. “Hello… mouse?”</p>\n    <p> </p>\n    <p>“Greetings,” the mouse said with a little bow. I shook my head. I wasn’t bowing to a mouse.</p>\n    <p> </p>\n    <p>“Yes, fine, greetings. Are we done now?” I asked the detective. “Because I am currently talking to a mouse, and I would like some explanations.”</p>\n    <p> </p>\n    <p>“One more thing,” he said. “Ask it about the weather.”</p>\n    <p> </p>\n    <p>“Are you for real, right now?”</p>\n    <p> </p>\n    <p>“Just do it.”</p>\n    <p> </p>\n    <p>I rolled my eyes, but academy training was hard to kick. Someone says jump, you ask how high. Or ask after the weather. “How’s the weather?” I said to the mouse with a wild grin on my face.</p>\n    <p> </p>\n    <p>“Fair,” the mouse replied. “The leaves are falling early this year, but the rain has stayed off for now.”</p>\n    <p> </p>\n    <p>“Great.”</p>\n    <p> </p>\n    <p>The detective took a step towards me and peered at my face. “What did he say?”</p>\n    <p> </p>\n    <p>“You heard what it said–”</p>\n    <p> </p>\n    <p>“No, you tell me. Repeat what the mouse said.”</p>\n    <p> </p>\n    <p>Shaking my head at the stupidity of the statement I did as I was told. “The leaves are falling early, but the rain has stayed off for now. Is that it, are we done with this madness now?”</p>\n    <p> </p>\n    <p>“You really did hear it.”</p>\n    <p> </p>\n    <p>\"Yes. I told you that.”</p>\n    <p> </p>\n    <p>“Yes, I’m sorry. I just had to make sure that you weren’t lying.”</p>\n    <p> </p>\n    <p>All sense of decorum went out the window. “Look, mate, of all the things I’m going to lie about, ‘I can hear mice complain about the weather’ isn’t one of them.”</p>\n    <p> </p>\n    <p>The detective ran a hand across his hair and smiled sheepishly. “Yeah. Guess not. I’m sorry, like I said, I’ve never met anyone else who can do this. I had to be sure.”</p>\n    <p> </p>\n    <p>“But, you know, <em>how</em>? How are we hearing animals talk?”</p>\n    <p> </p>\n    <p>“No idea. I’ve never found any explanation, or even a suggestion that it’s happened before.”</p>\n    <p> </p>\n    <p>“Then how…”</p>\n    <p> </p>\n    <p>“Did I discover it? I used to do it as a kid, but then I figured it was just something wrong with my head. One day I got fed up at a crime scene, saw a squirrel and asked for help, and it led me right to wear the stolen goods had been stashed. Insurance fraud, and I proved it in about ten minutes. From there it just kind of grew.”</p>\n    <p> </p>\n    <p>“So what, you’re Detective Inspector Dolittle?”</p>\n    <p> </p>\n    <p>He laughed and looked even younger as years of secrets drifted away from him. “Something like that I guess.”</p>\n    <p> </p>\n    <p>“What happened here then?”</p>\n    <p> </p>\n    <p>He looked down at the body and the smile dropped. “Accidental death, deliberate dumping. She died in her home, I reckon, maybe a fight, maybe sheer unhappy chance. Her partner panicked, knew about all the murders out here, so came and dumped her here. Maybe he’s got a record or something. But I’ve got a registration number for the car, so we can go and check it out. By the sounds of it he’s feeling guilty, so it shouldn’t take long to push him to a confession.”</p>\n    <p> </p>\n    <p>I had been nodding along, till I fixated on one word. “We?”</p>\n    <p> </p>\n    <p>He looked back at me and blushed. “I thought so. I mean, I could use a hand working all these cases, and you can work the same way as me.”</p>\n    <p> </p>\n    <p>“Hold on. You mean, become a detective?”</p>\n    <p> </p>\n    <p>“Don’t you want to?”</p>\n    <p> </p>\n    <p>“I mean…” In truth I hadn’t thought about it until then. My eyes fell to the corpse again. How many things had she been planning to do, or put off doing? I had to swallow the lump out my throat before I could answer though. “All right. I’m in. Assuming you can sort it with the boss.”</p>\n    <p> </p>\n    <p>The detective grinned at me. “I have a lot of pull. I can figure something out.” He stuck his hand out, which I took. “Detective Inspector Christopher Griffiths.”</p>\n    <p> </p>\n    <p>“Officer Iris Andrews.”</p>\n    <p> </p>\n    <p>“A pleasure to meet you, Iris. Now, let’s go talk to a murderer, shall we?”</p>\n</article>"
      },
      {
        "id": 2,
        "title": "Murder at Ex-Ir Con",
        "story": "<article><p>The Extreme Ironing Convention was infamous in Preston.&nbsp; For the last eight years, extreme ironers from around the world fell upon the city.&nbsp; Their antics in the streets caused emergency calls for days.&nbsp; Ironing on top of city buses.&nbsp; Ironing while hang-gliding over downtown.&nbsp; Ironing while belaying down the cupola of City Hall.&nbsp; Every year, there was one incident that truly left its mark on Preston. This year, the incident would be the death of Shawn Morrison.</p>\n    <p> </p>\n    <p>I looked down at Shawn’s body, his face brutalized by a blunt object.&nbsp; In any other situation, identifying the murder weapon might have been tricky, but not here.&nbsp; Not at Ex-Ir Con.</p>\n    <p> </p>\n    <p>There was no mistaking the iron-shaped dent in the dead man’s head.&nbsp; I had seen it before.&nbsp; I clenched my fists, remembering the day that my wife had been murdered eight years ago.&nbsp; The image of her face haunted my nightmares, beautiful until it had been ruined by a Bosch TDA 2650 GB Quickfill, the highest rated iron of 2012.</p>\n    <p> </p>\n    <p>Preston’s coroner had estimated the time of death at about 2:15am.&nbsp; The murder weapon had not been found yet, and the trail of blood leading out of Shawn’s hotel suite had run cold quickly. No witnesses had come forward.&nbsp; The extreme ironing community was notoriously tight-knit and likely to protect their own.&nbsp; They had done so in the past.</p>\n    <p> </p>\n    <p>“Detective Clay, they’re ready.”&nbsp; A police officer on scene had separated the suspects, and she handed me a list of names.&nbsp; I squared my shoulders and got started with the interview process.</p>\n    <p> </p>\n    <p><strong>Anna Krueger</strong></p>\n    <p> </p>\n    <p>Anna Krueger, the hotel manager, was already in Shawn’s suite pacing around and surveying the extensive damage.&nbsp; Pieces of drywall and broken glass littered the carpet, and the tell-tale burn marks of overly hot irons defaced the furniture and carpet.</p>\n    <p> </p>\n    <p>I watched her until she stopped mid-pace near the end table next to the couch and knelt down.&nbsp; Anna stuck her arm in a hole in the wall and pulled out a Panasonic NI-A66-K Automatic iron.</p>\n    <p> </p>\n    <p>“I never would have allowed these Extreme Ironing United States assholes to have Ex-Ir Con here again if I weren’t so hard-up for money.&nbsp; At least they rented out the entire place.” Anna glared at the iron-shaped hole in the drywall.&nbsp; “They always ruin something.&nbsp; They leave burns and run up the electric bills plugging in all their stupid irons.”</p>\n    <p> </p>\n    <p>She raised her eyes to meet mine and brandished the iron.&nbsp; “But this time, Shawn went too far.”</p>\n    <p> </p>\n    <p>“When was the last time you saw him, Ms. Krueger?”</p>\n    <p> </p>\n    <p>“He came down last night around 11 asking for more towels.”&nbsp; She pointed at a pile of charred towels near the couch.&nbsp; “I can see why he asked.”&nbsp; Anna held out the Panasonic iron, her hand shaking.&nbsp; “The temperature gauge is on the highest setting.&nbsp; He was burning things on purpose.&nbsp; If he were still alive, I’d sue him into oblivion!”</p>\n    <p> </p>\n    <p>“Ms. Krueger, do-”</p>\n    <p> </p>\n    <p>“Check with that ironing board vendor, Detective.&nbsp; I had to chase him out of the storage room around 2:30 this morning.&nbsp; Mighty suspicious, if you ask me.”</p>\n    <p> </p>\n    <p><strong>Erroll Fleming</strong></p>\n    <p> </p>\n    <p>Erroll Fleming, the owner of the Cleveland Ironing Board Company, leaned against the wall in his room. “That damned Shawn,” he growled, German accent thick on his tongue. “He ruined me.&nbsp; He posted negative reviews of my new ironing board design and used his extreme ironing championship fame and influence to boost them.”</p>\n    <p> </p>\n    <p>“Go on.”</p>\n    <p> </p>\n    <p>“The Cleveland Steamer.&nbsp; It was a board made specifically for steam irons.&nbsp; Shawn is - was - a proponent of steam irons, but he said my board had a shitty design.&nbsp; His was the number one review on Amazon!&nbsp; Everyone saw it.&nbsp; My profits tanked.&nbsp; No one bought!&nbsp; I am glad he is gone.”</p>\n    <p> </p>\n    <p>“I’m sure his negative reviews were the only reason no one bought the board.”</p>\n    <p> </p>\n    <p>Erroll’s eyes widened, and he straightened his back.&nbsp; “I am not happy he is dead.&nbsp; That is a terrible thing to say.&nbsp; I am innocent, of course.”</p>\n    <p> </p>\n    <p>“Mr. Fleming, can you tell me what you were doing in the storage closet last night?”</p>\n    <p> </p>\n    <p>Color rose to his cheeks.&nbsp; “I cannot say.&nbsp; It would ruin me!”</p>\n    <p> </p>\n    <p>“I thought your business was already ruined by Mr. Morrison.”</p>\n    <p> </p>\n    <p>“Yes, my beautiful Cleveland Steamer, but I had other boards in development.”</p>\n    <p> </p>\n    <p>“What does this have to do with your excursion?”</p>\n    <p> </p>\n    <p>Erroll sucked in a breath and held it until I thought he might faint.&nbsp; Finally, he breathed out and answered.&nbsp; “I was looking at the hotel’s ironing boards.”</p>\n    <p> </p>\n    <p>I frowned.</p>\n    <p> </p>\n    <p>“I couldn’t come up with any good ideas!” he wailed.&nbsp; “I was looking for inspiration.&nbsp; You can’t tell anyone that I’m an ironing board design fraud!”</p>\n    <p> </p>\n    <p>Erroll slumped back against the wall.&nbsp; “Gottverdammt,” he whispered.</p>\n    <p> </p>\n    <p>“Thank you for your time, Mr. Fleming.&nbsp; Please-”</p>\n    <p> </p>\n    <p>“Wait!&nbsp; You should talk to the tall man with curly hair.&nbsp; I saw him sneaking out of Shawn’s room last night after 2.”</p>\n    <p> </p>\n    <p><strong>Thomas Prince</strong></p>\n    <p> </p>\n    <p>“The tall man with curly hair” was Thomas Prince, a long-time advocate for the use of steam irons over dry irons in the Extreme Ironing competition world.&nbsp; Thomas was a prolific donor to Kickstarter campaigns for new steam iron technology, and he wielded a Rowenta DW5270U1 Focus Excel steam iron during competitions.</p>\n    <p> </p>\n    <p>He looked up from the hotel bed when I walked in, eyes red and puffy.&nbsp; “Detective?”</p>\n    <p> </p>\n    <p>“I hear you were out late.”</p>\n    <p> </p>\n    <p>“Yeah, I went to see Shawn.”</p>\n    <p> </p>\n    <p>“Any particular reason?”</p>\n    <p> </p>\n    <p>“We’re friends.”&nbsp; Thomas frowned and corrected himself.&nbsp; “Were friends.”</p>\n    <p> </p>\n    <p>“Mr. Prince, your visit makes you the last person to see Shawn alive.”</p>\n    <p> </p>\n    <p>“That doesn’t mean anything.&nbsp; Have you talked to Noah yet?&nbsp; He was going to drop some major news on us tonight, and Shawn got wind of it yesterday.&nbsp; He was so upset.”</p>\n    <p> </p>\n    <p>“What news?”</p>\n    <p> </p>\n    <p>“Shawn wanted to take over EIUS.&nbsp; He thought Noah was doing a shit job, and he’s never been shy about voicing his opinion.&nbsp; Noah threatened him, so Shawn took a swing.&nbsp; Caught him right in the jaw.&nbsp; Good thing he has a weak punch.”</p>\n    <p> </p>\n    <p>“Go on.”</p>\n    <p> </p>\n    <p>Thomas leaned back.&nbsp; “Not much else to say.&nbsp; I went to Shawn’s room to talk him down after that.&nbsp; He was pretty shaken up and talking about leaving EIUS completely.&nbsp; Noah had really gotten him riled up.”</p>\n    <p> </p>\n    <p>“I appreciate the information.&nbsp; In the meantime, I would like you to stay right here.”</p>\n    <p> </p>\n    <p>Thomas shot me an annoyed look.&nbsp; “Am I still a suspect?”</p>\n    <p> </p>\n    <p>“You were seen leaving Shawn’s room last night, and his body was found this morning.&nbsp; I’d say you’re the primary suspect.</p>\n    <p> </p>\n    <p>I called for additional officers to watch Thomas’ room while one officer remained inside.</p>\n    <p> </p>\n    <p><strong>Noah Bowers</strong></p>\n    <p> </p>\n    <p>I approached the sullen President of Extreme Ironing United States, Noah Bowers, in the hotel’s business center.&nbsp; He looked up from his seat at a small conference table.&nbsp; Before I could say anything, Noah spoke.</p>\n    <p> </p>\n    <p>“You think I did it, don’t you?”</p>\n    <p> </p>\n    <p>“I didn’t say that.”</p>\n    <p> </p>\n    <p>“But you know I threatened him, right?&nbsp; Well, he threatened me first.&nbsp; I didn’t want him to, like, think I was intimidated.”&nbsp; Noah stood up and spun one of the chairs.&nbsp; “Look, bro, Shawn was a dick, okay?&nbsp; That’s no secret. &nbsp; So he wanted to oust me and, like, take over as President of the EIUS.&nbsp; That doesn’t mean I killed him.”</p>\n    <p> </p>\n    <p>I said nothing.</p>\n    <p> </p>\n    <p>Noah grunted and crossed his arms.&nbsp; “If you really want to know who did it, you should talk to his fiancé Marin, bro.&nbsp; She was gonna, like, poison him or something.”</p>\n    <p> </p>\n    <p><strong>Marin Knox</strong></p>\n    <p> </p>\n    <p>I visited Marin in her hotel room.&nbsp; She was sitting calmly on the hotel bed watching a reality show, and she didn’t bother to look up as I entered the room.</p>\n    <p> </p>\n    <p>“I understand you found Shawn this morning, Ms. Knox.”</p>\n    <p> </p>\n    <p>“Sure did.&nbsp; I went in to make sure he was up in time for the convention.&nbsp; He liked to sleep in.”</p>\n    <p> </p>\n    <p>“You had access to his room?”</p>\n    <p> </p>\n    <p>She stared at me.&nbsp; “Duh.&nbsp; We were engaged.”</p>\n    <p> </p>\n    <p>“You don’t seem upset that your fiancé was murdered.”</p>\n    <p> </p>\n    <p>Marin shrugged.&nbsp; “I’m not.&nbsp; He was an abusive, cheating piece of shit, and I was going to end things tonight.&nbsp; But now I have to thank someone for saving me the trouble.”</p>\n    <p> </p>\n    <p>“I understand you were planning to poison Shawn.”</p>\n    <p> </p>\n    <p>Marin cocked a thin brow.&nbsp; “Why would I poison him when I could leave him?&nbsp; That’s why I got my own room in the first place.&nbsp; I was thinking of putting eye drops in his food so he’d shit his guts out.&nbsp; So yeah, maybe that’s technically poisoning him, but he wouldn’t have died or anything.”</p>\n    <p> </p>\n    <p>“It’s still an actionable offense, Ms. Knox.”</p>\n    <p> </p>\n    <p>“Whatever.&nbsp; Like I said, I didn’t do it.”&nbsp; She paused in thought.&nbsp; “You should talk to Eddie.&nbsp; I saw him arguing with Shawn yesterday.&nbsp; It looked pretty heated, but I didn’t stick around to listen.&nbsp; Probably something to do with steam versus dry irons again.&nbsp; Eddie’s crazy for dry irons.”</p>\n    <p> </p>\n    <p><strong>Eddie Wu</strong></p>\n    <p> </p>\n    <p>Eddie Wu was doodling on hotel stationery, but he put the pen down as I walked into his room.&nbsp;</p>\n    <p> </p>\n    <p>“I understand you and Mr. Morrison exchanged words yesterday.”</p>\n    <p> </p>\n    <p>“We have the same argument every time we see each other,” Eddie said, sitting up a little straighter.&nbsp; “He’s always going on about steam iron superiority, but he fails to see the beauty and simplicity of a classic dry iron.”</p>\n    <p> </p>\n    <p>“When did you last see Mr. Morrison?”</p>\n    <p> </p>\n    <p>Eddie continued as though I hadn’t spoken.&nbsp; “Using a dry iron is an art form.”&nbsp; He walked across the room towards an ornate case.&nbsp; “Let me show you.”</p>\n    <p> </p>\n    <p>“That’s okay, I-”</p>\n    <p> </p>\n    <p>“My iron!” he cried out in panic.&nbsp; Eddie showed me the empty case.&nbsp; “Where is it?”</p>\n    <p> </p>\n    <p>“How-”</p>\n    <p> </p>\n    <p>Eddie sank to his knees, tears spilling from his eyes.&nbsp; “My glorious iron.&nbsp; I can’t believe it’s gone.”</p>\n    <p> </p>\n    <p>“Mr. Wu, I need-”</p>\n    <p> </p>\n    <p>“I don’t care about your needs, Detective.&nbsp; What about mine?&nbsp; My iron is missing!&nbsp; The perfect soleplate, unblemished by steam holes, polished to a high shine.&nbsp; Did you know I had a custom handle built to fit my hand perfectly?”</p>\n    <p> </p>\n    <p>My heart skipped a beat, and an image of my wife thrust itself into my head.&nbsp; The iron mark on her face wasn’t perfectly smooth.&nbsp; There were spots - steam holes - but Shawn’s mark had no holes.&nbsp; He was killed with a dry iron.</p>\n    <p> </p>\n    <p>“Mr. Wu,” I said, struggling to keep my voice even, “who else here is a dry iron aficionado?”</p>\n    <p> </p>\n    <p>“You wouldn’t believe me if I told you.”</p>\n    <p> </p>\n    <p>“Try me.”</p>\n    <p> </p>\n    <p>Eddie grinned like the Cheshire cat.&nbsp; “Shawn Morrison.”</p>\n    <p> </p>\n    <p>“Did anyone else know?”</p>\n    <p> </p>\n    <p>Eddie shrugged.&nbsp; “This is a small world, Detective.&nbsp; It’s hard to hide something so scandalous.”&nbsp; His grin faded.&nbsp; “You should talk to Thomas.”</p>\n    <p> </p>\n    <p><strong>Thomas Prince</strong></p>\n    <p> </p>\n    <p>Thomas jerked up in surprise as I walked in the door.&nbsp; He set aside the iron he was cradling and wiped a tear from his eye.</p>\n    <p> </p>\n    <p>“Mr. Prince, how well do you know the others at this convention?”</p>\n    <p> </p>\n    <p>“Well, me and Shawn go way back, of course.&nbsp; Eddie’s been around for a while.&nbsp; We don’t agree on irons, but he’s a nice guy.&nbsp; Marin came into the mix a couple years ago.&nbsp; Noah’s been the president of EIUS for a long time, but he mostly keeps to himself.&nbsp; I don’t know him that well.”</p>\n    <p> </p>\n    <p>“Do you know if anyone might have a motive to harm Mr. Morrison?”</p>\n    <p> </p>\n    <p>“Marin and Shawn have been together for a long time, but that’s been falling apart.”&nbsp; Thomas made a face.&nbsp; “She’s a real piece of work.&nbsp; I wouldn’t trust her with my iron under any circumstances.&nbsp; But I don’t really know the others well enough to say.”</p>\n    <p> </p>\n    <p>I took a deep breath.&nbsp; “Did you know that Shawn was secretly into dry irons?”</p>\n    <p> </p>\n    <p>Thomas winced.&nbsp; “I went to visit him after he argued with Noah.&nbsp; He was really stressed out.&nbsp; I don’t think he meant to tell me, but he slipped up.&nbsp; He told me about his preference for dry irons.”</p>\n    <p> </p>\n    <p>“Go on.”</p>\n    <p> </p>\n    <p>“I was shocked, you know?&nbsp; We had spent years talking about the merits of steam irons over dry.”&nbsp; Thomas threw his hands in the air.&nbsp; “I mean, you can use a steam iron as a dry iron!&nbsp; But he just kept talking about how cool Eddie’s iron was.”</p>\n    <p> </p>\n    <p>Thomas stood and walked to the window.&nbsp; “I asked him if I could have his championship winning steam iron.”</p>\n    <p> </p>\n    <p>“And?”</p>\n    <p> </p>\n    <p>“I know it was kind of selfish to even ask, but it’s a steam iron.”&nbsp; He faced me, his mouth hard.&nbsp; “If he was so into dry irons, there’s no reason he needed to keep that one.”</p>\n    <p> </p>\n    <p>I knew the answer already.&nbsp; “He said no.”</p>\n    <p> </p>\n    <p>Thomas hung his head.&nbsp; “Yeah.”</p>\n    <p> </p>\n    <p>That’s when I noticed it.&nbsp; A plug barely poked out from under the hotel’s dresser.&nbsp; Thomas noted my pause and followed my gaze.&nbsp; We lunged at the same time, but I reached the dresser first, knelt, and yanked the cord.</p>\n    <p> </p>\n    <p>And there it was: the Oster Heavyweight GCSTBV4119 Classic, stained with what was surely the victim’s blood.&nbsp; Eddie Wu’s missing iron.</p>\n    <p> </p>\n    <p>I expected to fight my way out of the situation, but Thomas sat down heavily and exhaled.</p>\n    <p> </p>\n    <p>“I didn’t mean to kill him.”</p>\n    <p> </p>\n    <p>I backed away from Thomas to the room door.</p>\n    <p> </p>\n    <p>“Shawn had Eddie’s iron in his room.&nbsp; He was messing with it.&nbsp; I think he was trying to break it so Eddie wouldn’t win in today’s competition.”&nbsp; Thomas groaned.&nbsp; “And that was bad enough.&nbsp; If the sponsors found out, we’d lose all those investments.&nbsp; But when he refused to give me his steam iron, I just snapped.”</p>\n    <p> </p>\n    <p>I stuck my head out the door and motioned for the nearest officer to assist me.</p>\n    <p> </p>\n    <p>“Before I could even think about what I was doing, Shawn was on the floor, and I was holding Eddie’s iron.&nbsp; I brought it back here to hide it, but you see how much good that did me.”&nbsp; Thomas looked down at his hands.&nbsp; “I’ll never iron again.”</p>\n    <p> </p>\n    <p>The officer casually entered the room.</p>\n    <p> </p>\n    <p>“I won’t resist,” he said, looking straight at me.&nbsp; “I messed up.”</p>\n    <p> </p>\n    <p>“Mr. Prince, please remain still,” the officer said gently as she bent down and handcuffed Thomas’ hands behind his back.</p>\n    <p> </p>\n    <p>The officer led Thomas away, but the satisfaction of solving the case rang hollow in my heart.&nbsp; I returned to other suspects to tell them they were free to go.</p>\n    <p> </p>\n    <p>When I got to Marin's room, she simply nodded and started packing her things.&nbsp; But there was something I had to know.</p>\n    <p> </p>\n    <p>“Did you know your boyfriend was a dry iron promoter?”</p>\n    <p> </p>\n    <p>Marin’s eyes widened.&nbsp; “Shawn’s been advocating the benefits of steam irons both in competition and in the home for years.”</p>\n    <p> </p>\n    <p>The slight tremble in her voice gave her away.&nbsp; She was hiding something.</p>\n    <p> </p>\n    <p>“What aren’t you telling me, Ms. Knox?”</p>\n    <p> </p>\n    <p>She stared at the floor and bit her lip.&nbsp; “Look, he’d always use a steam iron for shows and competitions because that’s what people expected.&nbsp; He had a sponsor to please, a wealthy one.&nbsp; But behind closed doors, we-” Marin took a deep, shuddering breath.&nbsp; “Behind closed doors, we used a dry iron.”</p>\n    <p> </p>\n    <p>She buried her face in her hands.&nbsp; “Oh god, you can’t tell anyone!&nbsp; His reputation would be destroyed.&nbsp; The sponsor would pull all their funding out of the projects he and Thomas were working on.”</p>\n    <p> </p>\n    <p>“Like what?”</p>\n    <p> </p>\n    <p>“They had an idea to improve this older model steam iron, right?&nbsp; To make it more efficient and easier to clean.&nbsp; The steam holes on that model were tough to clean, but it was otherwise a great iron.&nbsp; I would even use it sometimes when he wasn’t at home.&nbsp; I liked it better than his dry iron.”&nbsp; She laughed sadly.&nbsp; “He would have been so mad.”</p>\n    <p> </p>\n    <p>Marin stood up and started to pace.&nbsp; “Anyway, he never got a new steam iron, so he always used the same one.&nbsp; His championship iron.&nbsp; It was iconic.&nbsp; Blue and white.&nbsp; Have you ever seen it?”</p>\n    <p> </p>\n    <p>Something in her voice made me uneasy.</p>\n    <p> </p>\n    <p>“Let me show you,” Marin continued.&nbsp; “It’s beautiful, Xavier.”</p>\n    <p> </p>\n    <p>“How... how do you know my name?”</p>\n    <p> </p>\n    <p>She opened a decorative case near the foot of the hotel bed and pulled out an iron.</p>\n    <p> </p>\n    <p>My blood ran cold.</p>\n    <p> </p>\n    <p>It was a Bosch TDA 2650 GB Quickfill.</p>\n    <p> </p>\n    <p>Marin smirked at my expression.&nbsp; “You recognize it, don’t you?&nbsp; Or rather, you recognize the shape of the soleplate.&nbsp; It was the same one that killed your wife eight years ago.”&nbsp; She stepped closer, her grin widening.&nbsp; “He did it, you know?&nbsp; Shawn killed her.&nbsp; She found out his secret obsession with dry irons, and he couldn’t allow her to talk.”</p>\n    <p> </p>\n    <p>I inched my hand towards my concealed pistol.&nbsp; “Put the Bosch down, Marin.&nbsp; You don’t have to do this.”</p>\n    <p> </p>\n    <p>Marin raised the iron, her pupils dilated with madness.&nbsp; “But I’ve always wanted to know what it felt like.&nbsp; What it could feel like to kill someone.”</p>\n    <p> </p>\n    <p>She swung the iron towards my head, barely missing.&nbsp; I called for backup and pulled out my pistol to defend myself.&nbsp; “I don’t want to shoot you.”</p>\n    <p> </p>\n    <p>Two police officers swept into the room before I had to take any further actions.&nbsp; Marin was quickly disarmed and handcuffed.&nbsp; She glared at me as the officers pulled her from the room,&nbsp; but she said nothing further.</p>\n    <p> </p>\n    <p>My heart ached with memories of my wife.&nbsp; Whether he knew it or not, Thomas had given her a little bit of justice, but that didn’t excuse his actions.&nbsp; He would be behind bars for a long time.&nbsp; Marin would serve time for being an accessory to murder for covering up Shawn’s crimes.&nbsp; I would have preferred to see Shawn stand trial, to look into his face with satisfaction as the bailiffs hauled him away.</p>\n    <p> </p>\n    <p>I would have to content myself knowing the truth of my wife’s murder had finally been ironed out.</p>\n</article>"
      },
      {
        "id": 3,
        "title": "Fall Of the Stars",
        "story": "<article><p>The heavens glittered with stars as the man silently drove over dirt and gravel, the thousand twinkling eyes mocking his desperation.&nbsp;</p>\n    <p> </p>\n    <p>Muttering a curse under his breath, he slowed down at the rusty security gate at the entrance of the abandoned mines. To an ordinary person it would be a half-broken gate with just a couple of night guards sleeping their shift away. But then again, the average person wouldn’t notice that the old equipment was strewn about almost too cleanly, or that the uniformed guards lacked an identity or a logo.</p>\n    <p> </p>\n    <p>Or how a cold eye glinted from under the angled cap, a sleek gun pointed at any approaching vehicle. Private security.</p>\n    <p><em>Good,</em>&nbsp;he smiled. He’d expected nothing less.</p>\n    <p> </p>\n    <p>He rolled down a window and casually brought up his right hand to scratch his stubble, flashing them the tattoo on his arm. One of guards came over to inspect it, shining a flashlight right in his face. Satisfied, he nodded to the other one, and the gate opened.</p>\n    <p> </p>\n    <p>The newcomer growled at them as he drove past. The guards didn’t blink.</p>\n    <p> </p>\n    <p>He took the car to the mouth of the mines and parked it aside a vintage piece, tossing the keys inside when he got out.&nbsp;</p>\n    <p><em>Won’t be getting out in this ride, that’s for sure.</em></p>\n    <p>He took one last look at the night sky. The stars still winked at him.&nbsp;<em>I’ll show you, you damned twinklers,</em>&nbsp;he thought.&nbsp;<em>And then you and your glowing arses can collectively burn the fuck out.</em></p>\n    <p> </p>\n    <p>He walked in and took the narrow elevator down, fixing a crick in his neck to look at the small black camera from the corner of his eye. The caged door opened into a tunnel entrance sealed long-ago. Dim light and vulgar music blared from within.&nbsp;</p>\n    <p> </p>\n    <p> </p>\n    <p>The tunnel widened into a narrow hall within, a despicable den of sin. Sellers had set up their wooden stalls on either side, sporting wares of all kinds and catering to the needs of anyone bold or foolish enough to venture within.&nbsp;</p>\n    <p> </p>\n    <p>A place fit for the lowest of low-life scum, the kind who’d kill their own mothers for the right price. Everything in the hall was as good as Eden’s forbidden fruit on Earth, attracting a number of fools who’d end up unconscious in dirty alleys, pickpocketed at best, missing an organ or an appendage – if not sporting a slit throat, at worst.&nbsp;</p>\n    <p> </p>\n    <p>The market and its dealers had been thriving in the sealed mine for almost a decade now, and he had no doubt that even the poorest of these merchants could have half the law enforcement in their pockets.&nbsp;</p>\n    <p> </p>\n    <p>He grunted.&nbsp;<em>Hell, half the buying and betting crowd out here was law enforcement</em>. Drugs, flesh, poison, weapons– they themselves would know where best to find any product being sold in the dark hall. The man sighed and jammed a hand in his pocket, pulling out a pack of gum. He looked it over with a frown and popped one in his mouth, tossing the rest in a makeshift stall with a wink at the seller.&nbsp;<em>Let him pour over hours wondering what’s so special about it</em>, he allowed the thought to bring him a dry chuckle.&nbsp;</p>\n    <p> </p>\n    <p>Visibly relaxed now, he cleared his thoughts and covered the tattoo on his arm, lest it be discovered by someone who carried one of its counterparts. He’d thought about this evening too much to spend it in a petty black-market fight.&nbsp;</p>\n    <p> </p>\n    <p>Ignoring the purrs of a woman offering him the finest opium and a merchant sporting priceless stolen jewels, he made his way to the guarded room on the other end, where once again a discreet flash of his ink admitted him within.</p>\n    <p> </p>\n    <p>A flash of white greeted him on the other side. White tiles decked the room, save for the ceiling, which held a long mirror across the length of it. Across the table from him sat a red-faced man in a puff of smoke, cigar in one hand and a wicked blade in the other, a host of monitors beside him. Eye of The Market. He leaned forward with his mouth split in a grin, rivulets of sweat running down his temple into his short-cropped white hair.</p>\n    <p> </p>\n    <p>“Welcome, my friend. Mr. Rahsut, I presume? I’m Gvadiskvi, we… spoke via our mutual contact, who sadly passed away today.” He took his visitor’s hand, shaking it and nodding. “Tragic, really, but you know how it is. I was hoping you’d stop by this week. Give us a chance to talk in person.”</p>\n    <p> </p>\n    <p>“Yes. A conversation has been long due.” The man called Rahsut replied, pulling his hand back. He remained standing.</p>\n    <p>“Now, my friend. We are friends, yes? He-he. I would offer you a cigar, but unfortunately, I do not yet know if you are a friend. Let’s save the cigar for later, then. A question for now. I heard from our friend Rihake you were taking an interest in the pits. You ask many questions, my friend, he-he. I must know, now, because I dislike having to answer so many questions, do you intend to partake in any way at all? Place a few bets, maybe indulge yourself in a match? Perhaps you’d like me to fix one for you, if only your first to get you a little start? He-he, say so, and we have a deal.”</p>\n    <p> </p>\n    <p>“I don’t want to place bets, Gvadiskvi.”</p>\n    <p>His host’s eyes narrowed, his smile faltering “Then you will understand, there are steps to be taken. We must be cautious about our little venture, he-he.”</p>\n    <p> </p>\n    <p>&nbsp;“You misunderstand,&nbsp;<em>friend</em>.” He spat with a smile of his own, “I wish to fight in the pits.”</p>\n    <p>The red-faced man barked a laugh, hurling his cigar across the room. “Well, then, my friend, he-he, we must drink to that!” he shouted “I knew I liked you the moment you walked in.” He poured out a strange green liquor in glass mugs kept behind his desk. “Come, Mr. Rahsut, we drink to victory. To living forever, and battering one’s enemies to death!”</p>\n    <p> </p>\n    <p>The man called Rahsut raked a hand through his dusty hair, clenching his fist at the drawn-out conversation “I do not drink before a fight. I will, however, take a whiff of your finest snow.”</p>\n    <p>“Aye, it is a cold night, Mr. Rahsut, and you are a bold one.” he sniggered “My new friend, a man of taste!”&nbsp;</p>\n    <p> </p>\n    <p>The man called Gvadiskvi obliged, immediately sending for his finest of the drug. He invited his guest to sit across him and talk. “Come then, tell me.” He grinned “What brings you here?”</p>\n    <p>Rahsut tilted his head, starting. “I t-”</p>\n    <p>“Huh-uh” he was cut off “Please, do not insult my intelligence. I’m curious,” the other man leaned forward “I truly am. Why would a man like you resort to this?”</p>\n    <p> </p>\n    <p>He stared across the table icily. “You don’t know me. Don’t pretend to.”</p>\n    <p>“But surely someone such as you would have noticed the shadows trailing you, yes?” A giggle. “They’ve been watching you. The way you walk, the way you talk… the much-concealed desperation in your eyes… he-he.”</p>\n    <p> </p>\n    <p>“Maybe I have a death wish.”</p>\n    <p>“Ah, but that’s not the half of it, my dear Mr. Rahsut, is it?” his watery eyes gleamed, sending a shiver of revulsion down the addressed man’s spine.</p>\n    <p>“Having a death wish doesn’t have to be personal.” He said quietly.</p>\n    <p>“Oh, but coming here always is.”&nbsp;</p>\n    <p> </p>\n    <p> </p>\n    <p>His drug came and he consumed it, courtesy of the House. He rolled his neck, grasping at his colliding thoughts and the clarity he now had. He pulled out the battered old pocket watch; A half hour still remained before he’d fight. The man called Rahsut suddenly realized that he was talking and stopped, visibly shaken. He found himself staring across at his half-witless host who beseeched him to continue.</p>\n    <p> </p>\n    <p>“You were at the bit where you had the epiphany after giving up your old ways, when the fighting was over. Go on, then.”&nbsp;</p>\n    <p>He considered for a moment, then shrugged.&nbsp;<em>No harm done. Screw it, it wouldn’t matter after tonight anyway.</em></p>\n    <p> </p>\n    <p>“When it struck me,” he spoke through the piece of gum still in his mouth “How much the stars and I are alike.&nbsp;</p>\n    <p>Gvadiskvi hummed in appreciation “How poetic for a man of your… bearing. But do tell, how so?”</p>\n    <p>“It’s silly, really, but also true.” he snorted a scoff, waving his hand airily. “When they die, it’s got to be a cosmic carnage, or no one knows cares, because otherwise no one would know when they die.”</p>\n    <p> </p>\n    <p>The other man spoke through a puff of smoke as he lit another cigar “Ah, much like battle veterans and mercenaries such as yourself, eh? He-he.”</p>\n    <p>“Yes, and the natural way is… too mundane.” He tasted the word on his tongue, and how morbid it felt. “So, I thought why not die in a carnage and make people care.”</p>\n    <p>“Care?” Gvadiskvi went silent for a long moment. “Do you truthfully think the people he-”</p>\n    <p>“Enough to place bets, anyway.” He retorted.</p>\n    <p> </p>\n    <p>The elder man undid a button on his shirt, rolling back his shoulders. “Fair enough. You want to bring business to me, who am I to refuse, my violent friend?”</p>\n    <p> </p>\n    <p>A bolt of lightning went up his spine, and Rahsut tilted his head. His host noticed it.</p>\n    <p>“Oh, come on. I’ve been running the pits for nine years now, how many of your kind do you think I’ve seen?” he huffed a laugh, thick smoke momentarily covering his face. “I lost the count from not caring, Mr. Rahsut, if I ever was honest, and you’re simply another face in that pile. Men like you, you only like violence. Do you know why?”</p>\n    <p> </p>\n    <p>He looked at him, very still.</p>\n    <p>“Because it’s the easiest thing to do.” He continued, twirling the knife in his hand. “So you go about your life, with violence as your creed, until suddenly one day you realize that you’re all alone. So, what do you do?&nbsp;</p>\n    <p>He said nothing as the eyes across his bore into his own with a cruel smile.</p>\n    <p>“You turn on yourself, becoming violent to life itself. Hating your existence, and desperate for the bittersweet mercy the&nbsp;<em>idea</em>&nbsp;of death offers.” Gvadiskvi looked into his eyes. “And so…</p>\n    <p> </p>\n    <p>“You turn to men like me. Like I said, Mr. Rahsut, I recognize people like you. I think you’ll find some kindred spirits in here this evening. Try to be merciful to them a little, he-he.” He finished with a twinkle in his eyes.</p>\n    <p> </p>\n    <p>Feeling uncomfortably vulnerable, he rode on a surge of blood and vaulted over the table in a blur, grabbing Gvadiskvi to whirl behind him, the knife now in his hand and held to his host. “If you claim to know my motivations so well, then tell me,&nbsp;<em>friend</em>,” he spat, “Why don’t I be a gentleman and grant you some mercy right now?”</p>\n    <p> </p>\n    <p>The man laughed softly, feeling his own blade digging into his throat. “I am trying to be polite, Mr. Rahsut, but if you move that knife one inch closer to me, I will rip your heart out. Besides, we both know that you’d rather put on an impressive display, if you are so adamant on dying.”</p>\n    <p> </p>\n    <p>Rahsut released him, taking a step back. “The pits are crowded tonight,” Gvadiskvi remarked with the eyes of a predator “Our old friend Rihake picked you a good night to fight, he-he…”</p>\n    <p> </p>\n    <p> </p>\n    <p> </p>\n    <p>The fighting pits had been emptied and a large area cleared for the closing event of the night. It was sparsely decorated, a handful of oil drums scattered to provide cover and a few low-hanging bulbs as the only source of light in the wide hall.</p>\n    <p> </p>\n    <p>The crowd was brimming with nervous energy, with people shoving each other for the best spot to view the last fight without falling inside. Rules of the arena were clear<em>;&nbsp;</em>A single step in and you were fair game.</p>\n    <p> </p>\n    <p>The audience silently parted as its supreme benefactor glided through. Aytanpar Gvadiskvi, the man who ran the pits, and every piece of low-life scum that haunted the mines. He raised his arm, holding a glass of exquisite liquor, and the world fell silent.</p>\n    <p> </p>\n    <p>“Greetings, Children of the Pits!” he boomed “I have a special night in store for you. The matches till now have offered but a slice of the excitement to come.” He looked at those who would fight now, spotting them in the audience.&nbsp;</p>\n    <p> </p>\n    <p>“No-life is better than half a life. Tonight, the six individuals gathered in the arena share more than blood-brothers do in a lifetime! They share this thought, and are willing to fight to the death to prove it. They are the superior people amongst us, for these men and women have looked into the eyes of desire and stared it down. Riches or luxury, a good, quiet life… that’s too much to ask of them. They live for the combat, and for the combat they willingly die! Most of them, anyway…” he trailed off.</p>\n    <p> </p>\n    <p>The crowd cheered. The man nodded and continued, “We are graced with our weapons master, Mr. Black, offering us the chance to witness his latest wares in action!”&nbsp;</p>\n    <p>The crowd went wild, shrieks and whoops filling the air as the said man joined Gvadiskvi, completely decked in black, only parts of his face not covered by his wide-brimmed hat or sunglasses visible as his lip burst in a cheery laugh. He waved. “Tonight, I bring to you,” he started in a deep voice as the crowd went silent “The only functioning prototypes of my latest gun, a tranquilizer coated with poison from deadly toads... and from my herb garden. Highly flammable, although one wouldn’t need fire for them to do their job. A slight graze could end a grizzly’s life, to say nothing of our own. Up for auction next week!”</p>\n    <p> </p>\n    <p>Murmurs streaked across the room as Gvadiskvi continued, “To make it more of a challenge, each of the fighters are equipped with a gun, good for two shots. No other weapons. Look closely, for if you blink, you may miss it... but mind your eyes, he-he.”</p>\n    <p> </p>\n    <p>At a signal, six figures stepped in the cleared area. A lithe figure prowled in, carefully eyeing her opponents. The woman had a vicious smile plastered on her face, tracing a finger up her leather-like body armor. “My new guns will go well with the gear.”</p>\n    <p>The other woman grunted and flicked her the finger. A thin man slicked a tongue over his teeth, filed into sharp fangs. “We’ll see about that, doll.” Two other men staggered inside, either drunk or badly beaten up recently.&nbsp;</p>\n    <p> </p>\n    <p>Rahsut was handed his gun as he weighed his options. Oil drums for cover. Low-hanging lightbulbs. A stale piece of gum in his mouth and a gun with two rounds of poison within. He nodded, taking a deep breath.&nbsp;<em>In mortality lies my victory. In victory, a worthy death. Till my last breath, the carnage will not stop.&nbsp;</em>He looked up in front of him. The carnage must stop. Tonight, then<em>. Death is life.&nbsp;</em></p>\n    <p> </p>\n    <p>A bell rang without warning and the crowd roared as slivers of crimson flew all around, spraying up a shower of blood where they struck. He moved in a flash, ducking past a couple of darts and backhanding a lightbulb. Those nearest to him flinched, momentarily blinded.&nbsp;</p>\n    <p>Those two died first.</p>\n    <p> </p>\n    <p>He shimmied up behind the loudmouthed girl with the protective gear, swiftly shooting at the unbalanced man across the room. He was dead before he fell, the dart buried in his eye. Grabbing her by the hair, he smashed her nose on the oil drum and she cried out, instinctively raising a hand to her face. He snaked a hand into the side of her neck and snapped, snatching the gun out of her hands even as her body fell.&nbsp;</p>\n    <p> </p>\n    <p>He ducked as a barrage of darts flew past him. Pressing his back against a drum, Rahsut peeked to find the other drunk-or-injured man already dead while the man with the razor-sharp teeth wrestled with the bulky woman, their guns tossed a few feet away.</p>\n    <p> </p>\n    <p><em>Huh. So much for that momentary truce.</em></p>\n    <p>He spied the lightbulb near him, still swinging. He grabbed it with one hand, pulling out the chewing gum with the other and sticking it on the bulb, recoiling when the hot glass burned his finger.&nbsp;</p>\n    <p><em>At least this will go quicker than I anticipated</em>, he thought as the glowing bulb twinkled like the stars outside.&nbsp;<em>Damned twinkler.</em></p>\n    <p> </p>\n    <p>He moved quickly, moving behind another oil drum as he fired twice at the one directly beneath the bulb, then tossed the dead girl’s now empty gun at it for good measure. A thin spray or oil spurted from it, steadily growing into a tiny fountain leaking oil that quickly spread across the floor.&nbsp;</p>\n    <p> </p>\n    <p>This caught the attention of the woman, who had finished crushing the throat of the thin man and pummeling him to death with her fists. She grinned, going for the two guns at her feet even as he leaped, and the world froze.</p>\n    <p> </p>\n    <p>In that moment, Rahsut saw everything. The horror on Gvadiskvi’s face, the victory on the woman’s, the final moments of the mine as he shot at the lightbulb which burst apart, flames engulfing the oil an-</p>\n    <p><em>Boom.</em></p>\n    <p> </p>\n    <p> </p>\n    <p>The next day, all the papers talked about the mine blow-up. A gas explosion, they called it. The official report said that no one was around when it happened, no one got hurt. The clean-up crew moved quickly, doing multiple sweeps and gathering what they found before loading the bodies in a truck to be taken away and incinerated. Yet no one noticed a single hand twitching still, of the dead man who would still live, outliving his own carnage. No one noticed the mouth speak obscenities in broken whispers, cursing at himself, at the stars, and at life itself.</p>\n\n</article>"
      }
    ]
  },
  {
    "id": 4,
    "category": "Fantasy",
    "image": "assets/images/fantasy.jpeg",
    "stories": [
      {
        "id": 1,
        "title": "",
        "story": "Story"
      }
    ]
  },
  {
    "id": 5,
    "category": "Fiction",
    "image": "assets/images/fiction.jpeg",
    "stories": [
      {
        "id": 1,
        "title": "What’s Left",
        "story": "<article>\n<p>I wrap my fingers tightly around the clinging plastic of the trash bag, pull it open as wide as it’ll go, and watch him dump the remnants of our happiness into it.</p><p><br></p><p>His large arms twist and flex unnecessarily as he shovels extra hors<strong> </strong>d'oeuvres and scraps of entree into the bag. His upper lip is a thin white line, stretched tight below frowning eyes.&nbsp;</p><p><br></p><p>The faint and smoky gleam of the first stars illuminates our dining room. The windows are open to the still air, mingling the scent of grass and dew with the smell of recently extinguished candles. Near-empty glasses of wine sit with little pools of ruby liquid congealing at the bottom. I examine the imprints on the glasses, pink half-moons where lips lingered, small smudges from restless fingers.&nbsp;</p><p><br></p><p>I clear the table and he rinses the plates, loading my great-grandmother’s delicate china into the dishwasher with a force that makes me cringe. I say nothing but plan to return later and wash it all by hand.</p><p><br></p><p>Somewhere outside in the cool October air rings the plaintive, staccato song of an owl.&nbsp;</p><p><br></p><p>Not long ago, I would have added my voice to the bird’s, smiling at the easy rhythm of the duet. But tonight, silence slices into the fading evening once more and I leave it to fester like an open wound.</p><p><br></p><p>He leans backwards against the kitchen counter, glass of amber-colored whiskey in his calloused hand. I feel his eyes follow me around the room as I continue tidying up, returning the candles to their places, piling the used cloth napkins near the hall that leads to the laundry room. The starlight catches on the folds of my satin dress as I move. I haven’t worn a dress in ages. It feels foreign, out of place against my skin.</p><p><br></p><p>“Some party,” he says.</p><p><br></p><p>I nod, barely meeting his sharp grey eyes.</p><p><br></p><p>“Surprised the Williamses came. I haven’t talked to George in ages.”</p><p><br></p><p>I shrug. “I ran into Melanie at the store the other day and reminded her.”</p><p><br></p><p>“Oh.” He runs his finger along the rim of his glass, staring at the chairs where George and Melanie sat only an hour earlier. “Did you see George at the store, too?”</p><p><br></p><p>“No, just Mel,” I reply lightly.&nbsp;</p><p><br></p><p>He stands, leaves the kitchen, and plops himself into an armchair in the living room, whiskey still attached to his hand like glue.&nbsp;</p><p><br></p><p>I glance away, my gaze lingering on the neat bookshelves in the corner where George and I had chuckled over our mutual dislike of <em>Great Expectations, </em>reminiscing about wrinkly Dr. Barnum’s English Lit course. As we spoke, I realized George hadn’t changed much since college; his eyes still held that idealistic sparkle that made us instant friends. I, on the other hand, have faded. Dulled.&nbsp;</p><p><br></p><p>George was too polite to say anything, but I know he noticed.</p><p><br></p><p>“How long is your sister staying in town?” His voice is gravelly, starting to slur.</p><p><br></p><p>“Just until tomorrow afternoon. We were thinking of getting coffee together before she leaves.”</p><p><br></p><p>“You two didn’t talk much tonight,” he notes.</p><p><br></p><p>“No,” I reply, wiping the table slowly. “She’s been a bit reserved since the divorce.”</p><p><br></p><p>“That’s a shame. I liked Drew.”</p><p><br></p><p>“I didn’t,” I say quickly, feeling my blood heat in my cheeks as I think of the man’s infidelity, of how broken Sarah was when she called and told me everything. “I never did.”</p><p><br></p><p>He stills, musing and nursing the last of his whiskey. I watch the way it lingers on the fine line of his lips, which are pursed even more tightly together.</p><p><br></p><p>“We can leave the rest for tomorrow,” he says, gesturing at the last of the mess. “Come sit with me.”</p><p><br></p><p>I wipe down the last corner of the table, taking my time as I place the damp towel on the edge of the kitchen sink. I straighten the hem of my silvery dress, imagining for a moment that it is armor, cold and heavy and safe.&nbsp;</p><p><br></p><p>When I approach, he pulls me onto his lap with one hand and rests his chin on my taut shoulder. His face is hot, burning against my skin.</p><p><br></p><p>“Happy anniversary,” he whispers, wrapping his free arm a little too tightly around my waist.</p><p><br></p><p>“Happy anniversary,” I reply. I watch the starlight glitter in the diamond on my finger, catch a glimpse of my dark eyes in the golden band.</p><p><br></p><p>I try to remember when we first met, years ago, back before this sour taste hung in the air between us. All that comes to me is dim figures, specters and stains of who we used to be. Me, young and bright, full of the effortless weight of possibility. Him, tall and smiling, overflowing with confident infatuation.</p><p><br></p><p>But I realize now that he’s always had a bitterness to him, hidden beneath a fine layer of cloying honey. And from the first time we kissed, we burned into one another like cheap vodka and called it love.</p><p><br></p><p>He tilts his head, leaning into the curve of my neck. His soft waves of hair tickle my chin.&nbsp;</p><p><br></p><p>“You’d never hurt me, would you?” he asks. It’s more of a statement than a question, firm with a small lilt of uncertainty in the final fatal syllable.&nbsp;</p><p><br></p><p>I turn a little, forcing him to lift his head from my shoulder and meet my eyes.</p><p><br></p><p>“Would you?” My voice is little more than a whisper.</p><p><br></p><p>He is silent. Somewhere in that vast, unspoken space between us lies the answer to every question. I stand, watching his fingers cling for a moment to my hip before falling away, his hand wilting like a lily too long removed from the sun.</p><p><br></p><p>The owl resumes its song and I cross the room to close the windows, shivering at the final gust of cold air. I see myself reflected in the glass, my face distorted by the angles of the windowpanes. His figure is little more than a streak of color in the reflection, distant and unremarkable.</p><p><br></p><p>I glance over at what’s left: the garbage bag in the corner, crumbs on the table, empty wine bottles on the counter and the last bubbles of dish soap in the sink.&nbsp;</p><p><br></p><p>“I’ll take the trash out in the morning,” I say, and head to bed without looking back.</p>\n</article>"
      }
    ]
  }
]